{
  "POPOVER": {
    "WEATHER_PROGNOSIS": {
      "TITLE": "Neu: Prognose dank Wetterdaten jetzt 50% genauer",
      "DESCRIPTION": "Durch Integration von lokalen Wetterdaten können wir die Genauigkeit deiner Verbrauchs- und Erzeugungsprognose verbessern – vollkommen <b>kostenlos!</b>",
      "ADVANTAGES_HEADER": "Was bedeutet das für dich:",
      "ADVANTAGE_1": "Mehr Kosteneinsparung",
      "ADVANTAGE_2": "Mehr Effizienz",
      "ADVANTAGE_3": "Inkl. Wettervorhersage im Monitoring",
      "APP": "Jetzt im App Center verfügbar:",
      "CHECKBOX_LABEL": "Ich habe zur Kenntnis genommen, dass für die Nutzung der App die Weitergabe meiner personenbezogenen Daten des Hauptnutzers an Dritte erforderlich ist. Hinweise zum Umgang mit Ihren personenbezogenen Daten finden Sie <a href={{link}} target='_blank'>hier</a>.",
      "DECLINE": "Ablehnen",
      "ACCEPT": "Akzeptieren & Installieren",
      "SPINNER_TEXT_ACCEPTED": "Nur noch einen Moment – Die App wird installiert...",
      "SPINNER_TEXT_DECLINED": "Die App kann jederzeit später im FEMS App Center installiert werden.",
      "APP_WEATHER": "Wetter"
    },
    "ANNUAL_REVIEW": {
      "TITLE": "Entdecke deine Energy Journey 2025",
      "SUB_TITLE": "Dein persönlicher Jahresrückblick ist ab sofort online!",
      "DESCRIPTION": "Entdecke die Highlights deiner persönlichen Energienutzung, wie dein FENECON Speicher dein Zuhause unterstützt hat, welchen Beitrag du für die Energiewende geleistet hast und vor allem: wie sehr sich das 2025 für dich gelohnt hat.",
      "BUTTON_TEXT": "Jetzt Jahresrückblick ansehen",
      "CONCLUSION": "Mehr über die Kampagne erfahren - auf unserer Infoseite unter <br><a href='https://www.fenecon.de/meine-energy-journey-2025'>https://www.fenecon.de/meine-energy-journey-2025</a>",
      "HEADER_TEXT": "Dein persönlicher Jahresrückblich ist ab sofort online! Wir zeigen dir noch ungenutzte Möglichkeiten, wie du dein Energie-System noch effizienter gestalten kann, deinen Eigenverbrauch optimieren und weiter auf dem günstigsten Kurs unterwegs sein kannst."
    }
  }
}
