Repository: OpenEMS/openems
Catalog: doc/modules/ROOT/pages/i18n/*.po
Languages: de

source: You should see again OpenEMS UI, but this time you are not asked for a login (because Metadata.Dummy does not require any) and are directly forwarded to the Energy Monitor at `http://localhost:4200/device/edge0/index`. You are now seeing the data from OpenEMS Edge via OpenEMS Backend.
de: Sie sollten wieder OpenEMS UI sehen, aber dieses Mal werden Sie nicht um ein Login gebeten (weil Metadata.Dummy keine benötigt) und werden direkt an den Energy Monitor bei ' http://localhost:4200/device/edge0/index ' weitergeleitet. Sie sehen jetzt die Daten von OpenEMS Edge über OpenEMS Backend.

source: Introduction
de: Einleitung

source: Open Energy Management System
de: Offenes Energiemanagementsystem

source: The OpenEMS 'Internet of Things' stack contains three main components:
de: Der OpenEMS "Internet of Things"-Stack enthält drei Hauptkomponenten:

source: **OpenEMS Edge** runs on-site and actually controls the devices
de: **OpenEMS Edge** läuft vor Ort und steuert die lokalen Geräte

source: **OpenEMS UI** is the generic user interface
de: **OpenEMS UI** ist die generische Benutzeroberfläche

source: **OpenEMS Backend** runs on a (cloud) server, connects the decentralized Edge systems and provides aggregation, monitoring and control via internet
de: **OpenEMS Backend** läuft auf einem (Cloud) Server, verbindet die dezentralen Edge-Systeme und sorgt für Aggregation, Überwachung und Steuerung über das Internet

source: Features
de: Funktionen

source: The OpenEMS software architecture was designed to leverage some features that are required by a modern and flexible Energy Management System:
de: Die OpenEMS-Softwarearchitektur wurde entwickelt, um Funktionen bereitzustellen, die ein modernes und flexibles Energiemanagementsystem benötigt:

source: Fast, PLC-like control of battery inverters and other devices
de: Schnelle, SPS-ähnliche Steuerung von Batteriewechselrichtern und anderen Geräten

source: Easily extendable due to the use of modern programming languages and modular architecture
de: Leicht erweiterbar durch den Einsatz moderner Programmiersprachen und modularer Architektur

source: Wide range of supported devices - (battery) inverters, meters, etc. - and protocols
de: Große Auswahl an unterstützten Geräten - (Batterie-)Wechselrichter, Zähler, etc. - und Protokolle

source: Modern web-based real-time user interface
de: Moderne webbasierte Echtzeit-Benutzeroberfläche

source: OpenEMS ist eine modulare Plattform für Energiemanagement-Anwendungen. Es wurde um die Anforderungen der Steuerung, Überwachung und Integration von Energiespeichern zusammen mit erneuerbaren Energiequellen und ergänzenden Geräten und Dienstleistungen entwickelt.
de: OpenEMS ist eine modulare Plattform für Energiemanagement-Anwendungen. Es wurde um die Anforderungen der Steuerung, Überwachung und Integration von Energiespeichern mit erneuerbaren Energiequellen und ergänzenden Geräten und Dienstleistungen entwickelt.

source: PV Magazine Top Business Model Award
de: PV Magazin Top Business Model Award

source: Auch das PV Magazine erkennt das Potenzial eines Betriebssystems für die Energiewende und würdigt die OpenEMS Association bereits zum Start mit dem Top Business Model Award. Im Auftrag von Chefredakteur Dr. Michael Fuhs durfte Franz-Josef Feilmeier, CEO der FENECON GmbH, die Urkunde an seinen Bruder Stefan Feilmeier, frisch gewählter Vorstandsvorsitzender der OpenEMS Association, überreichen. Der Preisverleihung vorausgegangen war eine lesenswerte Diskussion über die Notwendigkeit und Möglichkeiten von Energiemanagementsystemen zwischen Franz-Josef Feilmeier und Hans Urban, die im Zuge der Verleihung link:https://www.pv-magazine.de/2018/11/12/pv-magazine-top-business-model-ein-betriebssystem-fuer-die-energiewende/?utm_source=CleverReach&utm_medium=email&utm_campaign=27-11-2018+FENECON+November+Newsletter&utm_content=Mailing_7205600[ebenfalls veröffentlicht wurde].
de: Auch das PV Magazine erkennt das eines Potenzial Betriebssystems für die Energiewende und würdigt die OpenEMS Association bereits zum Start mit dem Top Business Model Award. Im Auftrag von Chefredakteur Dr. Michael Fuhs durfte Franz-Josef Feilmeier, Geschäftsführer der FENECON GmbH, die Urkunde an seinen Bruder Stefan Feilmeier, frisch gewählter Vorstandsvorsitzender der OpenEMS Association, überreichen. Der Preisverleihung vorausgegangen war eine lesenswerte Diskussion über die Notwendigkeit und Möglichkeiten von Energiemanagementsystemen zwischen Franz-Josef Feilmeier und Hans Urban, die im Zuge der Verleihung link:https://www.pv-magazine.de/2018/11/12/pv-magazine-top-business-model-ein-betriebssystem-fuer-die-energiewende/?utm_source=CleverReach&utm_medium=email&utm_campaign=27-11-2018+FENECON+November+Newsletter&utm_content=Mailing_7205600[ebenfalls veröffentlicht wurde].

source: OpenEMS Association Newsletter
de: Newsletter der OpenEMS Association

source: Förderung der Diskussion und Vernetzung von Unternehmen und akademischen Einrichtungen zum Zwecke des Know-how Zugewinns und der vorausschauenden Entwicklungsplanung (z. B. durch Facharbeitsgruppen und Veranstaltungen)
de: Förderung der Diskussion und Vernetzung von Unternehmen und Aktuellen Einrichtungen zum Zwecke des Know-how-Zugewinns und der vorausschauenden Entwicklungsplanung (z. B. durch Facharbeitsgruppen und Veranstaltungen)

source: Unterstützung der Mitglieder bei der Beantragung öffentlicher Fördermittel auf nationaler und internationaler Ebene und der Koordination geförderter Projekte (z. B. durch Initiierung und Information über geeignete Förderinitiativen)
de: Unterstützung der Mitglieder bei der Beanöffentlicher Fördermittel auf nationaler und internationaler Ebene und der Koordination geförderter Projekte (z. B. durch Initiierung und Information über geeignete Förderinitiativen)

source: • Bayernwerk AG • Consolinno Energy GmbH • Discovergy GmbH • egrid application + consulting • FENECON GmbH • FE-Partner AG, FL • Fetron Hard- und Software GmbH • Fieber Kai • Fraunhofer-ISE • FS engineering & consulting • Heyer Georg • IBC-Solar AG • KACO New Energy GmbH • KNX Association • LEE Cooperative • Maschinenfabrik Reinhausen GmbH • Mussack • MVV Energie AG • NATURAL-Energy – Energie-Umwelt-Konzepte UG • Nothaft Neue Heizsysteme GmbH • Oxygen Technologies GmbH • REFU Eletronik • Regionalwerke GmbH & Co. KG • SEEL GmbH • Stadtwerk Haßfurt GmbH • Stadtwerke Speyer GmbH • StoREgio Energiespeicher Systeme e.V. • Storion Energy GmbH • Stromdao UG • VARTA Storage GmbH • Winter, Peter
de: • Bayernwerk AG • Consolinno Energy GmbH • Discovergy GmbH • egrid application + consulting • FENECON GmbH • FE-Partner AG, FL • Fetron Hard-und Software GmbH • Fieber Kai • Fraunhofer-ISE • FS Engineering & Consulting • Heyer Georg • IBC-Solar AG • KACO New Energy GmbH • K NX-Verein • LEE Cooperative • Maschinenfabrik Reinhausen GmbH • Mussack • MVV Energie AG • NATURAL-Energy – Energie-Umwelt-Konzepte UG • Nothaft Neue Heizsysteme GmbH • Oxygen Technologies GmbH • REFU Eletronik • Regionalwerke GmbH & Co. KG • Stadtwerk Haßfurt GmbH • Stadtwerke Speyer GmbH • StoREgio Energiespeicher Systeme e.V. • Storion Energy GmbH • Stromdao UG • VARTA Storage GmbH • Winter, Peter

source: LEE Cooperative info@project-lee.com
de: LEE kooperativ info@project-lee.com

source: Discovergy GmbH tz@discovergy.com
de: Entdeckung GmbH tz@discovergy.com

source: Research and Development
de: Forschung und Entwicklung

source: Enable Ancillary Services by Renewable Energy Sources
de: Verkaufende Dienstleistungen durch erneuerbare Energiequellen

source: Ziel des Projektes ist es, durch integrierte Geschäftsmodelle das große Potential von Speichern sowohl für den Endnutzer als auch den Verteilnetzbetreiber (VNB) zu erschließen. Dazu werden innovative Be- und Entladealgorithmen entwickelt, die die Eigennnutzung von Solarenergie und die Steuerung variabler Lasten optimieren.
de: Ziel des Projektes ist es, durch integrierte Geschäftsmodelle das große Potential von Speichern sowohl für den Endnutzer als auch den Verteilnetzbetreiber (VNB) zu erschließen. Dazu werden innovative Be-und Entladeal-men entwickelt, die die Eigennnutzung von Solarenergie und die Steuerung variabler Lasten optimieren.

source: Fenecon arbeitet hierzu mit den Projektpartnern https://www.dfki.de/web/[Deutsches Forschungszentrum für künstliche Intelligenz icon:external-link[]], https://discovergy.com/[Discovergy icon:external-link[]], https://www.enercity.de/privatkunden/index.html[enercity icon:external-link[]] und der https://www.tu-berlin.de/menue/home/[TU Berlin icon:external-link[]] zusammen.
de: Fenecon arbeitet hierzu mit den Projektpartnern https://www.dfki.de/web/[Deutsches Forschungszentrum für künstliche Intelligenz icon:external-link[]], https://tasy.com/[Discovergy icon:external-link[]], https://www.enercity.de/privatkunden/index.html [enercity icon:external-link[]] und der https://www.tu-berlin.de/menue/home/[TU Berlin icon:external-link[]

source: OpenEMS provides several virtual devices for testing and development. To set up the simulation-environment follow the setup guide in xref:gettingstarted.adoc[Getting Started]. The Apache Felix Web Console Configuration lists all OpenEMS component, but those which rely on external hardware can't be used for simulation. These are replaced by more generic components tagged with the "Simulator" prefix. Still, not all non-simulator devices rely on real hardware. Other components used in production, like Loggers, Controllers and Schedulers can be combined with the virtual devices to build a "living" system.
de: OpenEMS bietet mehrere virtuelle Geräte zum Testen und Entwickeln. Um die Simulationsumgebung einzurichten, folgen Sie dem Setup-Leitfaden in xref: gettingstarted.adoc [Getting Started]. Die Apache Felix Web Console Configuration listet alle OpenEMS-Komponente auf, aber diejenigen, die auf externe Hardware angewiesen sind, können nicht für die Simulation verwendet werden. Diese werden durch mehr generische Komponenten ersetzt, die mit dem Präfix "Simulator" versehen sind. Dennoch sind nicht alle Nicht-Simulator-Geräte auf echte Hardware angewiesen. Andere Komponenten, die in der Produktion zum Einsatz kommen, wie Logger, Controller und Scheduler, lassen sich mit den virtuellen Geräten kombinieren, um ein "lebendiges" System aufzubauen.

source: Types of Simulated Components
de: Arten von simulierten Komponenten

source: **DataSource**: A data-source generates lists of data and provides them as a channel to other components. The data can be generated by different means, which could be an augmented random-generator or a reader for a specific data-format like the "Simulator Datasource: CSV Reader".
de: * * DataSource * *: Eine Datenquelle generiert Datenlisten und stellt sie als Kanal zu anderen Komponenten zur Verfügung. Die Daten können mit verschiedenen Mitteln generiert werden, die ein erweiterter Zufallsgenerator oder ein Reader für ein bestimmtes Datenformat wie den "Simulator Datasource: CSV Reader" sein könnten.

source: **Devices**: Devices replace a hardware-component like a meter or an ess. There are two kinds of devices: ** **acting**: These devices act on their own. Their actions do not depend on other device's actions, but on data-sources. ** **reacting**: These devices analyse other device's channels/properties to deduce their own behavior.
de: * * Geräte * *: Geräte ersetzen eine Hardware-Komponente wie ein Meter oder ein ess. Es gibt zwei Arten von Geräten: * * * * Schauspiel * *: Diese Geräte handeln eigenständig. Ihre Handlungen hängen nicht von den Aktionen anderer Geräte ab, sondern von Datenquellen. * * * * reagiert * *: Diese Geräte analysieren die Channels/-Eigenschaften anderer Geräte, um ihr eigenes Verhalten abzuleiten.

source: Simulator Components
de: Simulator-Komponenten

source: `Simulator DataSource: CSV Reader`: Reads .csv files and provides their content according to the `io.openems.edge.simulator.datasource.api.SimulatorDatasource` interface. Its package contains several sample csv-files for different devices and situations.
de: ' Simulator DataSource: CSV Reader ': Listet .csv-Dateien auf und stellt deren Inhalt nach der ' io.openems.edge.simulator.datasource.api.SimulatorDatasource '-Schnittstelle zur Verfügung. Sein Paket enthält mehrere Beispiele csv-Dateien für verschiedene Geräte und Situationen.

source: `Simulator EssSymmetric Reacting`: Simulates the State of Charge of a ess device. Its behavior depends on configured controllers.
de: ' Simulator EssSymmetric Reacting ': Simuliert den Ladezustand eines Schachtes. Sein Verhalten hängt von konfigurierten Controllern ab.

source: `Simulator GridMeter Acting`: Intended to represent grid consumption/production. Portrays a datasource' values. It requests those tagged with the "ActivePower" key. The values are portrayed in the `SimulatedActivePower`, `ActivePower` and - divided by three - in the `ActivePowerL1`, `ActivePowerL2` and `ActivePowerL3` channels.
de: "Simulator GridMeter Acting": Ziel ist es, den Netzkonsum zu repräsentieren. Porträtiert die Werte eines Datencassource. Es fordert diejenigen, die mit der "ActivePower"-Taste markiert sind. Die Werte werden in den Kanälen ' SimulatedActivePower ', ' ActivePower ' und-geteilt durch drei-in den Kanälen ' ActivePowerL1 ', ' ActivePowerL2 ' und ' ActivePowerL3 ' dargestellt.

source: `Simulator ProductionMeter Acting`: Intended to represent fixed production like photovoltaic arrays. To date the functionality equals the one of `Simulator GridMeter Acting`.
de: "Simulator ProductionMeter Acting": Es soll eine feste Produktion wie Photovoltaik-Arrays darstellen. Bis heute entspricht die Funktionalität der von ' Simulator GridMeter Acting '.

source: `Simulator NRCMeter Acting`: Intended to represent non-regulated-consumption. To date the functionality equals the one of `Simulator GridMeter Acting`.
de: "Simulator NRCMeter Acting": Verwendet, um nicht regulierten Verbrauch darzustellen. Bis heute entspricht die Funktionalität der von ' Simulator GridMeter Acting '.

source: `Simulator GridMeter Reacting`: Intended to represent grid consumption/production. Takes all meters (but grid-meters) and esss, sums up their ActivePowers and divides this value by the number of grid-meters in the system. The negative of this result is then portrayed in the `SimulatedActivePower`, `ActivePower` and - divided by three - in the `ActivePowerL1`, `ActivePowerL2` and `ActivePowerL3` channels. This equals the physical reaction of the real grid.
de: ' Simulator GridMeter Reacting ': Ziel ist es, den Netzkonsum zu repräsentieren. Nimmt alle Meter (aber Gitterzähler) und esss, fasst ihre ActivePowers zusammen und teilt diesen Wert durch die Anzahl der Gittermeter im System. Das Negative dieses Ergebnisses wird dann in den Kanälen ' SimulatedActivePower ', ' ActivePower ' und-geteilt durch drei-in den ' ActivePowerL1 ', ' ActivePowerL2 ' und ' ActivePowerL3 '-Kanälen dargestellt. Das entspricht der physischen Reaktion des realen Gitters.

source: Possible Combinations
de: Mögliche Kombinationen

source: In reality the OpenEMS can not measure the non-regulated-consumers, as they are spread all over the building. However, it can measure the power at the mains connection, which can be used to calculate the non-regulated-consumption. This approach can be simulated using the `Simulator GridMeter Acting` combined with a `Simulator EssSymmetric Reacting`.
de: In Wirklichkeit können die OpenEMS nicht die nicht-regulierten Verbraucher messen, da sie über das gesamte Gebäude verteilt sind. Er kann aber die Leistung am Netzanschluss messen, mit dem der nicht regulierte Verbrauch berechnet werden kann. Dieser Ansatz kann mit dem "Simulator GridMeter Acting" in Kombination mit einem "Simulator EssSymmetric Reacting" simuliert werden.

source: For intelligent systems going beyond real-time-regulation, however, having a - even in production - virtual meter measuring the non-regulated-consumers can be a major advantage. In order to test algorithms depending on such an environment, the simulator provides the `Simulator ProductionMeter Acting`, the `Simulator NRCMeter Acting` and the `Simulator GridMeter Reacting`.
de: Für intelligente Systeme, die über die Echtzeitregulierung hinausgehen, kann es jedoch ein großer Vorteil sein, wenn es um einen-auch in der Produktion-virtuellen Zähler geht, der die nicht-regulierten Verbraucher misst. Um Algorithmen je nach einer solchen Umgebung zu testen, bietet der Simulator den ' Simulator ProductionMeter Acting ', den ' Simulator NRCMeter Acting ' und den ' Simulator GridMeter Reacting '.

source: Build OpenEMS UI
de: **OpenEMS UI** ist die generische Benutzeroberfläche

source: This chapter explains, how OpenEMS UI can be compiled so that it can be executed outside of an IDE.
de: In diesem Kapitel wird erklärt, wie OpenEMS UI kompiliert werden kann, so dass es außerhalb einer IDE ausgeführt werden kann.

source: Open the terminal inside Visual Studio Code (Menu: btn:[Terminal] -> btn:[New Terminal]).
de: Öffnen Sie das Terminal im Visual Studio Code (Menü: btn: [Terminal]-> btn: [Neues Terminal]).

source: Build using angular-cli from command line
de: Mit angular-cli aus der Kommandozeile bauen

source: Execute the following commands inside the `ui` directory of your OpenEMS repository. The build artifacts will be stored in a subfolder of the `target` directory
de: Führen Sie die folgenden Befehle im ' ui '-Verzeichnis Ihres OpenEMS-Projektarchivs aus. Die Build-Artefakte werden in einem Unterordner des ' Zielverzeichnisses ' gespeichert

source: To get more help on `angular-cli` use `ng help` or go check out the link:https://github.com/angular/angular-cli/blob/master/README.md[Angular-CLI README].
de: Um mehr Hilfe bei ' angular-cli ' zu erhalten, verwenden Sie ' ng help ' oder schauen Sie sich den link:https:/github.com/angularar-cli/blob/master/README.md[Angular-CLI README] an.

source: Be aware that there is currently a link:https://github.com/angular/angular-cli/issues/11208[bug] in how angular-cli generates the service-worker configuration file (ngsw-config.json). After running the above command it is required to fix 'regex' statements in the file, replacing double '`\\`' by single '`\`' to avoid wrong escaping.
de: Seien Sie sich bewusst, dass es derzeit eine link:https://github.com/angular/angular-cli/issues/11208[bug] in der Art und Weise gibt, wie angular-cli die Konfigurationsdatei des Service-Workers (ngsw-config.json) erzeugt. Nach dem Ausführen des obigen Befehls ist es erforderlich, ' regex '-Anweisungen in der Datei zu beheben, indem man die doppelte ' \ \ ' ' durch eine einzelne ' \ ' ' ersetzt, um ein falsches Ausweichen zu vermeiden.

source: Build for OpenEMS Backend
de: **OpenEMS UI** ist die generische Benutzeroberfläche

source: Execute
de: Ausführen

source: The build artifacts are created in the directory `ui/target/backend`.
de: Die Build-Artefakte werden im Verzeichnis ' ui/target/backend ' erstellt.

source: Build for OpenEMS Edge
de: **OpenEMS Edge** läuft vor Ort und steuert die lokalen Geräte

source: The build artifacts are created in the directory `ui/target/edge`.
de: Die Build-Artefakte werden im Verzeichnis ' ui/target/edge ' erstellt.
