Repository: OpenEMS/openems
Catalog: doc/modules/ROOT/pages/i18n/*.po
Languages: de

source: Backend Architecture
de: Backend Architektur

source: Backend-to-Backend communication
de: Backend-zu-Backend Kommunikation

source: OpenEMS Backend provides two "Backend-to-Backend-Api" implementations, that provide a way to communicate with one or more OpenEMS Edge devices via backend connection. They are designed using the JSON-RPC communication protocol via REST/JSON (_io.openems.backend.b2brest_) or via Websocket (_io.openems.backend.b2bwebsocket_) connection.
de: OpenEMS Backend bietet zwei "Backend-to-Backend-Api"-Implementierungen, die eine Möglichkeit bieten, mit einem oder mehreren OpenEMS-Edge-Geräten über Backend-Verbindungen zu kommunizieren. Diese werden mit dem JSON-RPC-Kommunikationsprotokoll über REST/JSON (_io.openems.backend.b2brest_) oder über die Websocket (_io.openems.backend.b2bwebsocket_) Verbindung entwickelt.

source: Authentication
de: Authentifizierung

source: BasicAuth on opening of the connection.
de: BasicAuth bei der Öffnung der Verbindung.

source: Error Handling
de: Fehlerbehandlung

source: Errors are implemented according to the specs of JSON-RPC 2.0 (https://www.jsonrpc.org/specification#response_object). Possible error codes are documented here: https://github.com/OpenEMS/openems/blob/develop/io.openems.common/src/io/openems/common/exceptions/OpenemsError.java#L13
de: Fehler werden nach den Spezifikationen von JSON-RPC 2.0 (https://www.jsonrpc.org/specification#response_object) implementiert. Mögliche Fehlercodes werden hier dokumentiert: https://github.com/OpenEMS/openems/blob/develop/io.openems.common/src/io/openems/common/exceptions/OpenemsError.java#L13

source: Example:
de: Beispiel:

source: Properties `id` and `jsonrpc` can be omitted for JSON/REST, as they are not required for HTTP POST calls.
de: Eigenschaften `id` und `jsonrpc` können für JSON/REST weggelassen werden, da sie für HTTP-POST-Aufrufe nicht benötigt werden.

source: Requests
de: Anfragen

source: Lists the current status of all accessible Edges.
de: Listet den aktuellen Status aller zugänglichen Edges auf.

source: Request
de: Anfrage

source: Response
de: Antwort

source: Queries the latest value of certain channels for a number of Edge-Devices. Channels that are not available or do not have a current value are returned as `null`.
de: Fragt den aktuellen Wert bestimmter Kanäle für eine Reihe von Edge-Geräten ab. Kanäle, die nicht verfügbar sind oder keinen aktuellen Wert haben, werden als "null" zurückgegeben.

source: Registers a subscription for regular updates of channel values. Request is acknowledged by an empty success Response and followed by regular JSON-RPC Notifications. Du stop the subscription, an empty 'subscribeEdgesChannels' Request needs to be sent.
de: Registriert ein Abonnement für regelmäßige Aktualisierungen der Kanalwerte. Die Anfrage wird durch eine leere Erfolgsantwort und gefolgt von regelmäßigen JSON-RPC-Benachrichtigungen bestätigt. Um das Abonnement zu stoppen, muss eine leere "subscribeEdgesChannels"-Anfrage gesendet werden.

source: The parameter "count" must be increased with each new Request. Only the Request with the highest "count" value is active.
de: Der Parameter "count" muss mit jeder neuen Anfrage erhöht werden. Nur die Anfrage mit dem höchsten "count" Wert ist aktiv.

source: Notifications
de: Benachrichtigungen

source: Unsubscribe-Request
de: Anfrage abbestellen

source: Each battery storage system in an Edge-Device can be controlled to balance on a specific value at the grid connection point. This Request allows sending such a Schedule to an Edge-Device.
de: Jedes Batteriespeicher in einem Edge-Gerät kann so gesteuert werden, dass es am Netzanschlusspunkt auf einem bestimmten Wert ausbalanciert. Diese Anfrage erlaubt es, einen solchen Zeitplan an ein Edge-Gerät zu schicken.

source: { "jsonrpc":"2.0", "id":"UUID", "method":"setGridConnSchedule", "params":{ "id":"edgeId", "schedule":[ { "startTimestamp":1542464697, "duration":900, "activePowerSetPoint":0 } ] } }
de: { "jsonrpc":"2.0", "id": "UUID", { "jsonrpc":"2.0", "id":"UUID", "method":"setGridConnSchedule", "params":{ "id":"edgeId", "schedule":[ { "startTimestamp":1542464697, "duration":900, "activePowerSetPoint":0 } ] } } "Methode": "setGridConnSchedule", "Params": { "id": "EdgeId", "Zeitplan": [ { "startTimestamp":1542464697, "duration":900, "activePowerSetPoint":0 } ] } }

source: Build OpenEMS Backend
de: OpenEMS Backend bauen

source: This chapter explains, how OpenEMS Edge can be compiled to a JAR file that can be executed outside of an IDE.
de: In diesem Kapitel wird erklärt, wie OpenEMS Edge zu einer JAR-Datei kompiliert werden kann, die außerhalb einer IDE ausgeführt werden kann.

source: Build using Eclipse IDE
de: Mit Eclipse IDE bauen

source: Inside Eclipse IDE open the *io.openems.backend.application* project and open the link:https://github.com/OpenEMS/openems/blob/develop/io.openems.backend.application/BackendApp.bndrun[BackendApp.bndrun icon:code[]] file.
de: In der Eclipse IDE öffnen Sie das * io.openems.backend.application * Projekt und den link:https://github.com/OpenEMS/openems/blob/develop/io.openems.backend.application/BackendApp.bndrun [BackendApp.bndrun icon:code[]] file.

source: Press btn:[Export] to start the *Export Wizard Selection* assistant.
de: Drücken Sie [Export], um den"Export Wizard Selection"-Assistenten zu starten.

source: Select btn:[Executable JAR] and press btn:[Next >].
de: Wählen Sie btn:[Executable JAR] und drücken Sie btn:[Next >].

source: Select a *Destination* for *Export to JAR*.
de: Wählen Sie einen Zielort (*Destination*) für die exportierte JAR-Datei (*Export to JAR*).

source: Press btn:[Finish]
de: Drücken Sie btn:[Finish]

source: This creates a so called Fat-JAR-file including all bundles. It can be executed by running `java -jar openems-backend.jar` in a console.
de: Dadurch wird eine sogenannte Fat-JAR-Datei erstellt, die alle Bundles enthält. Es kann ausgeführt werden, indem man ' java-jar openems-backend.jar ' in einer Konsole startet.

source: Build using Gradle from command line
de: Mit Gradle aus der Kommandozeile bauen

source: link:https://gradle.org/[Gradle] is a build tool that is used in the OpenEMS project to compile the JAR-files and to execute other tasks like building the documentation webpage using link:https://antora.org/[Antora] and the Javadocs. To build OpenEMS Backend:
de: link:https:/gradle.org/[Gradle] ist ein Build-Tool, das im OpenEMS-Projekt verwendet wird, um die JAR-Dateien zu kompilieren und andere Aufgaben auszuführen, wie zum Beispiel das Bauen der Dokumentations-Webseite mit link:https:/antora.org/[Antora] und die Javadocs. OpenEMS-Backend zu bauen:

source: Open a console and change to your repository directory.
de: Öffnen Sie eine Konsole und wechseln Sie in Ihr Projektarchiv-Verzeichnis.

source: Execute `gradlew buildBackend`
de: Führen Sie `gradlew buildBackend` aus

source: Configuration
de: Konfiguration

source: Deploy OpenEMS Edge
de: **OpenEMS Edge** läuft vor Ort und steuert die lokalen Geräte

source: This chapter explains how OpenEMS Backend can be deployed on a Debian Linux server. Similar techniques will work for other operating systems as well.
de: In diesem Kapitel wird erklärt, wie OpenEMS Backend auf einem Debian-Linux-Server eingesetzt werden kann. Ähnliche Techniken werden auch für andere Betriebssysteme funktionieren.

source: Prepare operating system environment
de: Betriebssystemumgebung vorbereiten

source: It is recommended to run every service on a server with limited permissions. This example runs OpenEMS Backend with user "root" which is a bad idea for a production server!
de: Es wird empfohlen, jeden Dienst auf einem Server mit eingeschränkten Berechtigungen auszuführen. Dieses Beispiel läuft OpenEMS Backend mit dem Benutzer "root", was eine schlechte Idee für einen Produktionsserver ist!

source: Create an application directory
de: Ein Anwendungsverzeichnis erstellen

source: Create the directory */opt/openems-backend*. This is going to be the place, where we put the JAR file.
de: Erstellen Sie das Verzeichnis /opt/openems-backend. Dies wird der Ort sein, an dem wir die JAR-Datei platzieren.

source: Execute `mkdir /opt/openems-backend`.
de: Führen Sie die `mkdir/opt/openems-backend` aus.

source: Create a config directory
de: Ein Konfigurationsverzeichnis erstellen

source: Create the directory */opt/openems-backend/config.d*. This is going to be the place, where all the bundle configurations are held.
de: Erstellen Sie das Verzeichnis */opt/openems-backend/config.d *. Dies wird der Ort sein, an dem alle Bündelkonfigurationen stattfinden.

source: Execute `mkdir /opt/openems-backend/config.d`.
de: Führen Sie ' mkdir/opt/openems-backend/config.d ' aus.

source: Create a systemd service definition
de: Eine systemd-Service-Definition erstellen

source: The systemd 'Service Manager' manages system processes in a Debian Linux. We will create a systemd service definition file, so that systemd takes care of managing (starting/restarting/...) the OpenEMS Backend service.
de: Der Systemd 'Service Manager' verwaltet Systemprozesse in einem Debian Linux. Wir werden eine Systemd-Service-Definition-Datei erstellen, so dass sich die systemd um die Verwaltung (starting/restarting/...) des OpenEMS Backend-Service kümmert.

source: Create and open the service definition file.
de: Erstellen und öffnen Sie die Service-Definition-Datei.

source: Execute `nano /etc/systemd/system/openems-backend.service`
de: Führen Sie `nano/etc/systemd/systemd/openems-backend.service` aus

source: Paste the following content:
de: Fügen Sie folgenden Inhalt ein:

source: [Unit] Description=OpenEMS <1> After=network.target <2>
de: [Einheit] Beschreibung = OpenEMS <1> After = network.target <2>

source: The name of the service.
de: Der Name des Dienstes.

source: The service is allowed to start after network is available (e.g. to be able to access devices via ethernet connection)
de: Der Dienst darf nach der Verfügbarkeit des Netzwerks starten (z. B. um über die Ethernet-Verbindung auf Geräte zugreifen zu können)

source: It is run as user 'root' to have access to all devices. It is recommended to change this for productive systems.
de: Es wird als User ' root ' ausgeführt, um Zugriff auf alle Geräte zu haben. Es wird empfohlen, dies für produktive Systeme zu ändern.

source: OpenEMS Backend uses a "simple" process fork.
de: OpenEMS Backend verwendet eine "einfache" Prozessgabel.

source: The start command. It uses the Java JRE, sets the config directory to `/opt/openems-backend/config.d`, sets a parallelism value for ForkJoinPool - this depends on the number of OpenEMS Edge devices you expect to connect - and runs the jar file at `/opt/openems-backend/openems-backend.jar`
de: Der Startbefehl. Er verwendet das Java JRE, setzt das Konfigurationsverzeichnis auf `/opt/openems-backend/config.d`, setzt einen Parallelismus-Wert für ForkJoinPool-das hängt von der Anzahl der OpenEMS Edge-Geräte ab, die Sie verbinden wollen-und läuft die jar-Datei unter '/opt/openems-backend/ Openems-backend.jar '

source: In contrast to what systemd expects, Java exits with status 143 on success.
de: Im Gegensatz zu den Erwartungen von systemd wird Java bei Erfolg mit dem Status 143 beendet.

source: Systemd _always_ tries to restart OpenEMS Backend once it was quit.
de: Systemd versucht immer OpenEMS Backend neu zu starten sobald es einmal beendet wurde.

source: Systemd waits _10_ seconds till the next restart.
de: Systemd wartet 10 Sekunden bis zum nächsten Neustart.

source: Press btn:[Ctrl] + btn:[x] to exit and btn:[y] to save the file.
de: Drücken Sie btn:[Strg] + btn:[x] zum verlassen und btn:[y] um die Datei zu speichern.

source: Activate the service definition:
de: Aktivieren Sie die Service-Definition:

source: Execute `systemctl daemon-reload`
de: `systemctl daemon-reload` ausführen

source: Start OpenEMS Backend
de: Starte OpenEMS Backend

source: To update the OpenEMS JAR file at the target device, it is required to copy the JAR file from your build directory to `/opt/openems-backend/openems-backend.jar` on the server. Afterwards it is required to restart the systemd service
de: Um die OpenEMS-JAR-Datei auf dem Zielgerät zu aktualisieren, ist es erforderlich, die JAR-Datei aus Ihrem Build-Verzeichnis `/opt/openems-backend/openems-backend.jar` auf dem Server zu kopieren. Danach ist es erforderlich, den systemd-Dienst neu zu starten

source: (Re)start OpenEMS systemd service.
de: Den OpenEMS systemd Service (neu)starten

source: Execute `systemctl restart openems-backend --no-block; journalctl -lfu openems-backend`
de: Führen Sie `systemctl restart openems-backend --no-block; journalctl -lfu openems-backend` aus.

source: The command restarts the service (_systemctl restart openems-backend_) while not waiting for the OpenEMS startup notification (_--no-block_). Then it directly prints the OpenEMS system log (_journalctl -lfu openems-backend_).
de: Der Befehl startet den Dienst neu (_ systemctl restart openems-backend _), während er nicht auf die OpenEMS-Startmitteilung (_--no-block _) wartet. Dann druckt es direkt das OpenEMS-Systemprotokoll (_ journalctl-lfu openems-backend _).

source: Internal Component Communication
de: Interne Komponentenkommunikation

source: This page describes the internal communication protocol between OpenEMS Edge, OpenEMS Backend and OpenEMS UI. The components keep an open https://de.wikipedia.org/wiki/WebSocket[Websocket] connection which is used for bi-directional communication. The protocol is based on https://www.jsonrpc.org/specification[JSON-RPC]. For details about JSON-RPC please refer to the specification. As a rough summary, the protocol is divided into
de: Diese Seite beschreibt das interne Kommunikationsprotokoll zwischen OpenEMS Edge, OpenEMS Backend und OpenEMS UI. Die Komponenten halten eine offene https://de.wikipedia.org/wiki/WebSocket[Websocket]-Verbindung, die für die bidirektionale Kommunikation verwendet wird. Das Protokoll basiert auf https://www.jsonrpc.org/specification[JSON-RPC]. Details zum JSON-RPC finden Sie in der Spezifikation. Als grobe Zusammenfassung wird das Protokoll in

source: JSON-RPC Request
de: JSON-RPC-Anfrage

source: Identified by a unique ID and method name with specific params. Expects a Response.
de: Identifiziert durch eine eindeutige ID und Methodenname mit bestimmten Parametern. Erwartet eine Antwort.

source: JSON-RPC Success Response
de: JSON-RPC Antwort Erfolgreich

source: Referring to the ID of the Request, providing a result which can be empty or hold specific data.
de: Bezieht sich auf die ID der Anfrage und liefert ein Ergebnis, das leer sein kann oder bestimmte Daten speichert.

source: JSON-RPC Error Response
de: JSON-RPC Fehlermeldung

source: Referring to the ID of the Request, providing error code, message and optionally data.
de: Bezogen auf die ID der Anfrage, Bereitstellung von Fehlercode, Nachricht und optional Daten.

source: JSON-RPC Notification
de: JSON-RPC Benachrichtigung

source: Identified by a unique method name with specific params. Does not expect a Response.
de: Identifiziert durch einen einzigartigen Methodennamen mit bestimmten Parametern. Erwartet keine Reaktion.

source: The information on this page is useful to understand the internal communication structure and can help if your plan is to replace one component by a custom implementation, e.g. implementing your own frontend application, or if you plan to extend the provided feature-set.
de: Die Informationen auf dieser Seite sind nützlich, um die interne Kommunikationsstruktur zu verstehen und können helfen, wenn es Ihr Plan ist, eine Komponente durch eine benutzerdefinierte Implementierung zu ersetzen, z. B. die Implementierung Ihrer eigenen Frontend-Anwendung, oder wenn Sie planen, das bereitgestellte Feature-Set zu erweitern.

source: Authenticate UI to Edge/Backend using token
de: UI mit dem Token zu Edge/Backend autorisiert

source: On opening of the websocket connection to Edge/Backend, the UI is authenticated using an existing token.
de: Beim Öffnen der Websocket-Verbindung zu Edge/Backend wird die UI mit einem bestehenden Token authentifiziert.

source: Authenticate UI to Edge using password
de: Mit Passwort an Edge anmelden

source: Subscribe to Channels
de: Abonnieren Sie Channels

source: Allows a Component to subscribe on certain Channel values. The latest Channel values are then periodically sent.
de: Ermöglicht es einer Komponente, sich auf bestimmte Channel-Werte anzumelden. Die neuesten Channel-Werte werden dann regelmäßig gesendet.

source: Subscribe to System-Log
de: Abonniere System-Log

source: Sends the log output of Edge to UI via Backend.
de: Sendet die Protokollausgabe von Edge über Backend an UI.

source: Store channel data in Time-Series database
de: Die Kanaldaten in der Datenbank der Zeit-Reihe speichern

source: Edge Backend Api-Controller periodically sends data of Channels to Backend, where it is stored in a Time-Series database (like InfluxDB) via a Timedata service.
de: Edge Backend Api-Controller sendet regelmäßig Daten von Channels an Backend, wo sie über einen Timedata-Dienst in einer Datenbank der Zeitserie (wie InfluxDB) gespeichert werden.

source: Communicate with a specific Edge Component
de: Kommunizieren Sie mit einer bestimmten Edge-Komponente

source: This provides a way to send a JSON-RPC Request directly to a specific Edge Component identified by its Component-ID - e.g. to a specific Controller. To enable this, the Edge Component needs to implement the 'JsonApi' interface.
de: Dies bietet eine Möglichkeit, eine JSON-RPC-Anfrage direkt an eine bestimmte Edge Component zu senden, die durch die Component-ID identifiziert wird-z.B. an einen bestimmten Controller. Um dies zu ermöglichen, muss die Edge-Komponente die ' JsonApi '-Schnittstelle implementieren.

source: Core concepts & terminology
de: Kernkonzepte und Terminologie

source: This chapter describes some of the core concepts and commonly used terms in OpenEMS:
de: Dieses Kapitel beschreibt einige der Kernkonzepte und in OpenEMS verwendeten Begriffe:

source: OpenEMS Edge is using the https://en.wikipedia.org/wiki/OSGi[OSGi icon:external-link[]] platform to provide a completely modular and dynamic service oriented system.
de: OpenEMS Edge nutzt die Plattform https://en.wikipedia.org/wiki/OSGi[OSGi icon:external-link[]], um ein komplett modulares und dynamisches, serviceorientiertes System zu bieten.

source: Logical groups of source code are put into one OSGi Bundle. Every directory in the source code root directory starting with 'io.openems.*' is a bundle.
de: Logische Gruppen des Quellcodes werden in ein OSGi Bundle gelegt. Jedes Verzeichnis im Quellcode-Root-Verzeichnis, das mit 'io.openems. *' beginnt, ist ein Bündel.

source: OpenEMS Component
de: OpenEMS Komponente

source: OpenEMS Edge is built of Components, i.e. every main component implements the link:https://github.com/OpenEMS/openems/blob/develop/io.openems.edge.common/src/io/openems/edge/common/component/OpenemsComponent.java[OpenemsComponent interface icon:code[]].
de: OpenEMS Edge ist aus Komponenten gebaut, d.h. jede Hauptkomponente implementiert den link:https://github.com/OpenEMS/openems/blob/develop/io.openems.edge.common/src/io/openems/edge/common/component/OpenemsComponent.java[OpenemsComponent Interface icon:code[]].

source: By definition each Component has a unique ID. Those *Component-IDs* are typically:
de: Per Definition hat jede Komponente eine eindeutige ID. Diese *Komponenten-IDs* sind typischerweise:

source: `ess0` for the first storage system or battery inverter
de: `ess0` für das erste Speichersystem oder den Wechselrichter

source: `ess1` for the second storage system or battery inverter
de: `ess1` für das zweite Speichersystem oder den Wechselrichter

source: `meter0` for the first meter in the system
de: `meter0` für den ersten Zähler im System

source: If you receive your OpenEMS together with a FENECON energy storage system, you will find the following Component-IDs:
de: Wenn Sie Ihr OpenEMS zusammen mit einem FENECON Energiespeicher erhalten, finden Sie folgende Component-IDs:

source: FENECON Pro ** `ess0`: FENECON Pro Ess ** `meter0`: Socomec grid meter ** `meter1`: FENECON Pro production meter
de: FENECON Pro **`ess0`: FENECON Pro Ess** `meter0`: Socomec-Netzzähler **`meter1`: FENECON Pro Erzeugungszähler

source: FENECON Mini ** `ess0`: FENECON Mini ** `meter0`: FENECON Mini grid meter ** `meter1`: FENECON Mini production meter
de: FENECON Mini **`ess0`: FENECON Mini** `meter0`: FENECON Mini Netzzähler **`meter1`: FENECON Mini Erzeugungszähler

source: Each OpenemsComponent provides a number of Channels. Each represents a single piece of information. Each Channel implements the link:https://github.com/OpenEMS/openems/blob/develop/io.openems.edge.common/src/io/openems/edge/common/channel/Channel.java[Channel interface icon:code[]]. By definition each Channel has a unique ID within its parent Component.
de: Jeder OpenemsComponent bietet eine Reihe von Channels. Jeder stellt eine einzige Information dar und implementiert das link:https://github.com/OpenEMS/openems/blob/develop/io.openems.edge.common/src/io/openems/edge/common/channel/Channel.java[Channel Interface icon:code[]]. Per Definition hat jeder Channel eine eindeutige ID innerhalb seiner Mutterkomponente.

source: Natures extend normal Java interfaces with 'Channels'. If a Component implements a Nature it also needs to provide the required Channels. For example the Energy Storage System (ESS) Simulator link:https://github.com/OpenEMS/openems/blob/develop/io.openems.edge.simulator/src/io/openems/edge/simulator/ess/symmetric/reacting/EssSymmetric.java[Simulator.EssSymmetric.Reacting icon:code[]] implements the link:https://github.com/OpenEMS/openems/blob/develop/io.openems.edge.ess.api/src/io/openems/edge/ess/api/SymmetricEss.java[Ess interface icon:code[]] and therefor needs to provide a `Soc` Channel that provides the current 'State of Charge' of the battery.
de: Die Natures erweitern normale Java-Schnittstellen mit 'Channels'. Wenn ein Bauteil eine Natur implementiert, muss sie auch die benötigten Kanäle bereitstellen. Zum Beispiel das Energiespeicher-System (ESS) Simulator link:https://github.com/OpenEMS/openems/blob/develop/io.openems.edge.simulator/src/io/openems/edge/simulator/ess/symmetric/reacting/EssSymmetric.java[Simulator.EssSymmetric.Reacting icon:code[]] implementiert das link:https://github.com/OpenEMS/openems/blob/develop/io.openems.edge.ess.api/src/io/openems/edge/ess/api/SymmetricEss.java[Ess-Interface icon:code[]] und muss daher einen `Soc`-Channel zur Verfügung stellen, der den aktuellen 'Zustand der Ladung' der Batterie anzeigt.

source: xref:edge/controller.adoc[Controllers] are written against Nature implementations. Example: A Controller can be used with any ESS, because it can be sure that it provides all the data the Controller requires for its algorithm.
de: xref:edge/controller.adoc[Controller] verwenden Nature-Implementierungen. Beispiel: Ein Controller kann mit jedem ESS verwendet werden, weil er sicher sein kann, dass dieser alle Daten liefert, die der Controller für seinen Algorithmus benötigt.

source: Channel Address
de: Channel-Adresse

source: By combining the unique *Component-ID* and *Channel-ID* each Channel in the system can be addressed by a distinct 'Channel Address' in the form `Component-ID/Channel-ID`.
de: Durch die Kombination der eindeutigen *Component-ID* und *Channel-ID* kann jeder Channel im System durch eine eigene 'Channel-Adresse' in der Form 'Component-ID/Channel-ID' angesprochen werden.
