Repository: OpenEMS/openems
Catalog: doc/modules/ROOT/pages/i18n/*.po
Languages: de

source: Example: the state of charge ("Soc") of the first energy storage system ("ess0") has the channel address `ess0/Soc`.
de: Beispiel: Der Ladezustand ("Soc") des ersten Energiespeichers ("ess0") hat die Kanaladresse `ess0/Soc`.

source: The Scheduler handles the order, in which Controllers are executed. For details see xref:edge/controller.adoc[Scheduler and Controller] below.
de: Der Scheduler bearbeitet den Auftrag, in dem Controller ausgeführt werden. Weitere Informationen finden Sie unter xref:edge/controller.adoc[Scheduler und Controller] unten.

source: Controller
de: Steuerung

source: The actual business logic or algorithms are wrapped as 'Controllers'. i.e. they implement the link:https://github.com/OpenEMS/openems/blob/develop/io.openems.edge.controller.api/src/io/openems/edge/controller/api/Controller.java[Controller interface icon:code[]]. Each Controller holds one specific, encapsulated task.
de: Die eigentliche Geschäftslogiken oder Algorithmen werden als 'Controller' verpackt. Das heißt, sie implementieren das link:https://github.com/OpenEMS/openems/blob/develop/io.openems.edge.controller.api/src/io/openems/edge/controller/api/Controller.java[Controller-Interface icon:code[]]. Jeder Controller hat eine spezifische, gekapselte Aufgabe.

source: Documentation
de: Dokumentation

source: Concept
de: Konzept

source: The OpenEMS Documentation is built with https://antora.org/[Antora icon:external-link[]].
de: Die OpenEMS-Dokumentation ist mit https:/antora.org/[Antora icon:external-link[]] aufgebaut.

source: OpenEMS https://github.com/OpenEMS/openems[Files icon:external-link[]] and https://github.com/OpenEMS/openems.io[Documentation icon:external-link[]] are seperated on two different repositories.
de: OpenEMS https://github.com/OpenEMS/openems [Files icon:external-link[]] und https:/github.com/OpenEMS/OpenEMS/openems.io[Dokumentation icon:external-link[]] werden auf zwei verschiedenen Repositories getrennt.

source: The https://github.com/OpenEMS/openems/blob/develop/doc/build/uibundle_openems.zip?raw=true[UI icon:external-link[]] was slightly modified to fit our needs.
de: Die https://github.com/OpenEMS/openems/blob/develop/doc/build/uibundle_openems.zip?raw=true[UI icon:external-link[]] wurde leicht an unsere Bedürfnisse angepasst.

source: For more Information regarding https://asciidoctor.org/docs/asciidoc-writers-guide/[AsciiDoc icon:external-link[]] and https://docs.antora.org/antora/1.1/[Antora icon:external-link[]] see their Docs.
de: Für weitere Informationen zu https:/asciidoctor.org/docs/asciidoc-writers-guide/[AsciiDoc icon:external-link[]] und https://docs.antora.org/antora/1.1/[Antora icon:external-link[]] lesen Sie bitte die Dokumentationen der Projekte.

source: Edit a page
de: Eine Seite bearbeiten

source: If you want to edit a Docs - Page just click on 'Edit this Page' in the upper right corner to edit the page you are currently visiting.
de: Wenn Sie eine Docs-Seite bearbeiten wollen, klicken Sie einfach auf "Diese Seite bearbeiten" in der oberen rechten Ecke, um die Seite zu bearbeiten, die Sie gerade besuchen.

source: Edit the Page according to your ideas and commit your changes.
de: Bearbeiten Sie die Seite nach Ihren Vorstellungen und übertragen Sie Ihre Änderungen.

source: You will see the changes you have made after our frequent Docs - Update.
de: Sie werden die Änderungen sehen, die Sie nach unserem häufigen Update vorgenommen haben.

source: Add a page
de: Eine Seite hinzufügen

source: To add a page, clone the OpenEMS Repository (preferably xref:gettingstarted.adoc#_download_the_source_code[Source Tree]) and open it with a Code Editor (prefably xref:gettingstarted.adoc#_setup_visual_studio_code_for_openems_ui[Visual Studio Code]).
de: Um eine Seite hinzuzufügen, klonen Sie das OpenEMS-Repository (vorzugsweise xref:gettingstarted.adoc#_download_the_source_code[Source Tree]) und öffnen Sie es mit einem Code Editor (vorzugsweise xref:gettingstarted.adoc#_setup_visual_studio_code_for_openems_ui[Visual Studio Code]).

source: Go to https://github.com/OpenEMS/openems/tree/develop/doc/modules/ROOT/pages[doc/modules/ROOT/pages icon:external-link[]] and create a .adoc file with the desired name.
de: Gehen Sie zu https:/github.com/OpenEMS/openems/entwicklung/doc/modules/ROOT/pages[doc/modules/ROOT/pages icon:external-link[]] und erstellen Sie eine .adoc-Datei mit dem gewünschten Namen.

source: Go to https://github.com/OpenEMS/openems/blob/develop/doc/modules/ROOT/nav.adoc[doc/modules/ROOT/nav.adoc icon:external-link[]] and add your page with the correct filename to the nav file.
de: Gehen Sie zu https:/github.com/OpenEMS/openems/blob/doc/modules/modu.adoc [doc/modules/ROOT/nav.adoc (doc/modules/ROOT/nav.adoc icon:external-link[]] und fügen Sie Ihre Seite mit dem korrekten Dateinamen in die nav-Datei ein.

source: Build Docs
de: Docs bauen

source: To build the docs, clone the OpenEMS Repository (preferably xref:gettingstarted.adoc#_download_the_source_code[Source Tree]) and open it with a Code Editor (prefably xref:gettingstarted.adoc#_setup_visual_studio_code_for_openems_ui[Visual Studio Code]).
de: Um die Docs zu bauen, klonen Sie das OpenEMS-Repository (vorzugsweise xref:gettingstarted.adoc#_download_the_source_code[Source Tree]) und öffnen Sie es mit einem Code Editor (vorzugsweise xref:gettingstarted.adoc#_setup_visual_studio_code_for_openems_ui[Visual Studio Code]).

source: NodeJS has to be installed
de: NodeJS muss installiert werden

source: Install Antora via npm
de: Antora über npm installieren

source: Open Terminal and type:
de: Öffnen Sie das Terminal und tippen Sie:

source: Go to https://github.com/OpenEMS/openems/tree/develop/doc/build[doc/build icon:external-link[]] and type
de: Gehen Sie zu https://github.com/OpenEMS/openems/tree/develop/doc/build[doc/build icon:external-link[]] und tippen Sie

source: Docs should be building.. the finished HTML Folder can be found in your local 'build' folder (inside your https://github.com/OpenEMS/openems/tree/develop/doc/build[repository build folder icon:external-link[]])
de: Docs sollten gebaut werden .. Der fertige HTML-Ordner kann in Ihrem lokalen "build"-Ordner gefunden werden (in Ihrem https:/github.com/OpenEMS/OpenEMS/openems/entwicklung/doc/build[Projektarchiv build-Ordner icon:external-link[]])

source: If your data isn't updating properly or not building, try antora site.yml --pull to reset the cache
de: Wenn Ihre Daten nicht richtig aktualisieren oder nicht aufgebaut sind, versuchen Sie antora site.yml--pull, um den Cache zurückzusetzen

source: If you want to build your own docs with Antora see https://fabianfnc.github.io/bocs/[this guide icon:external-link[]]
de: Wenn Sie Ihre eigenen Docs mit Antora bauen wollen, besuchen Sie https://fabianfnc.github.io/bocs/[diesem Leitfaden icon:external-link[]]

source: OpenEMS is a modular platform for energy management applications. It was developed around the requirements of controlling, monitoring and integrating energy storage systems together with renewable energy sources and complementary devices and services.
de: OpenEMS ist eine modulare Plattform für Energiemanagement-Anwendungen. Es wurde um die Anforderungen der Steuerung, Überwachung und Integration von Energiespeichern zusammen mit erneuerbaren Energiequellen und ergänzenden Geräten und Dienstleistungen entwickelt.

source: The OpenEMS Edge software architecture is carefully designed to abstract device communication and control algorithms in a way to provide maximum flexibility, predictability and stability, while simplifying the process of implementing new components.
de: Die Software-Architektur von OpenEMS Edge wurde sorgfältig entwickelt, um die Kommunikation und Steuerung von Algorithmen von Geräten so zu abstrahieren, dass maximale Flexibilität, Vorhersehbarkeit und Stabilität gewährleistet sind, während gleichzeitig der Prozess der Implementierung neuer Komponenten vereinfacht wird.

source: Input-Process-Output
de: Eingabe-Verarbeitung-Ausgabe

source: OpenEMS Edge is built around the well-known IPO (input-process-output) model which defines the internal execution cycle.
de: OpenEMS Edge ist um das bekannte IPO-Modell (Input-Process-Output, "Eingabe-Verarbeitung-Ausgabe") aufgebaut, das den internen Ausführungszyklus definiert.

source: Input-Process-Output model
de: Eingabe-Verarbeitung-Ausgabe-Modell

source: Input
de: Eingabe

source: During the input phase all relevant information - e.g. the current 'state of charge' of a battery - is collected and provided as a *process image*. This process image is guaranteed to never change during the cycle.
de: Während der Eingangsphase werden alle relevanten Informationen - z. B. der aktuelle Ladezustand einer Batterie-gesammelt und als *Prozessabbild* zur Verfügung gestellt. Dieses Prozessabbild wird sich während des Zyklus garantiert nie ändern.

source: Process
de: Prozess

source: The process phase runs algorithms and tasks based on the process image - e.g. an algorithm uses the 'state of charge' information to evaluate whether a digital output should be turned on.
de: In der Prozessphase werden Algorithmen und Aufgaben auf Basis des Prozessbildes ausgeführt-z.B. nutzt ein Algorithmus die "State of Charge"-Informationen, um zu bewerten, ob eine digitale Ausgabe eingeschaltet werden soll.

source: Output
de: Ausgabe

source: The output phase takes the results from the process phase and applies it - e.g. it turns the digital output on or off.
de: Die Ausgabephase nimmt die Ergebnisse aus der Prozessphase auf und wendet sie an - z. B. schaltet sie die digitale Ausgabe ein oder aus.

source: Scheduler and Controller
de: Planer und Controller

source: During the 'process' phase different algorithms (Controllers) might try to access the same resources - e.g. two Controllers try to switch the same digital output. It is therefor necessary to prioritize their execution and restrict access according to priority.
de: Während der 'process'-Phase können verschiedene Algorithmen (Controller) versuchen, auf die gleichen Ressourcen zuzugreifen-z.B. zwei Controller versuchen, die gleiche digitale Ausgabe zu schalten. Daher ist es notwendig, ihre Ausführung zu priorisieren und den Zugang nach Priorität zu beschränken.

source: OpenEMS Edge uses Scheduler implementations to receive a sorted list of Controllers. The Controllers are then executed in order. Later executed Controllers are not allowed to overwrite a previously written result.
de: OpenEMS Edge verwendet Scheduler-Implementierungen, um eine sortierte Liste von Controllern zu erhalten. Die Controller werden dann in Ordnung ausgeführt. Spätere ausgeführte Controller dürfen ein zuvor geschriebenes Ergebnis nicht überschreiben.

source: IPO model with Scheduler and Controllers
de: IPO-Modell mit Scheduler und Controllern

source: Cycle
de: Zyklus

source: The input-process-output model in OpenEMS Edge is executed in a Cycle - implemented by the link:https://github.com/OpenEMS/openems/blob/develop/io.openems.edge.core/src/io/openems/edge/core/cycle/Cycle.java[Cycle component icon:code[]]. It handles the setting of a process image in the input phase and executes the Controllers in the process phase. Furthermore it emits Cycle Events that can be used in other Components to synchronize with the Cycle.
de: Das Input-Prozess-Output-Modell in OpenEMS Edge wird in einem Zyklus ausgeführt-implementiert durch den link:https://github.com/OpenEMS/openems/blob/develop/io.openems.edge.core/src/io/openems/edge/core/cycle/Cycle.java[Cycle-Komponenten icon:code[]]. Es übernimmt die Einstellung eines Prozessbildes in der Eingangsphase und führt die Controller in der Prozessphase aus. Darüber hinaus gibt es Cycle Events aus, die in anderen Komponenten verwendet werden können, um sich mit dem Zyklus zu synchronisieren.

source: OpenEMS Edge Cycle
de: **OpenEMS Edge** läuft vor Ort und steuert die lokalen Geräte

source: Asynchronous threads and Cycle synchronization
de: Asynchrone Threads und Zyklus-Synchronisation

source: Communication with external hardware and services needs to be executed in asynchronous threads to not block the system. At the same time, those threads need to synchronize with the Cycle.
de: Die Kommunikation mit externen Hardware und Diensten muss in asynchronen Threads erfolgen, um das System nicht zu blockieren. Gleichzeitig müssen diese Fäden mit dem Zyklus synchronisiert werden.

source: The following example shows, how the link:https://github.com/OpenEMS/openems/blob/develop/io.openems.edge.bridge.modbus/src/io/openems/edge/bridge/modbus/AbstractModbusBridge.java[Modbus implementation icon:code[]] uses Cycle Events to synchronize with the Cycle:
de: Das folgende Beispiel zeigt, wie der link:https://github.com/OpenEMS/openems/blob/develop/io.openems.edge.bridge.modbus/src/io/openems/edge/bridge/modbus/AbstractModbusBridge.java[Modbus Implementation icon:code[]] Cycle Events verwendet, um Synchronisation mit dem Zyklus:

source: Synchronize Cycle with Modbus read/write
de: Zyklusarbeit mit Modbus lesend/schreiben

source: Architecture scheme
de: Architekturschema

source: The following scheme shows the abstraction of hardware via Channels, Natures and Devices as well as the execution of control algorithms via Scheduler and Controllers.
de: Das folgende Schema zeigt die Abstraktion von Hardware über Kanäle, Naturen und Geräte sowie die Ausführung von Steuerungsalgorithmen über Scheduler und Controllers.

source: Architecture scheme
de: Architekturschema

source: To simplify the implementation of hardware that is connected via certain standardized physical connection layers and protocols, those are implemented as Bridges.
de: Um die Implementierung von Hardware zu vereinfachen, die über bestimmte standardisierte physikalische Verbindungsebenen und Protokolle verbunden ist, werden diese als Brücken implementiert.

source: Modbus is a widely used standard for fieldbus connections. It is used by all kinds of hardware devices like photovoltaics inverters, electric meters, and so on.
de: Modbus ist ein weit verbreiteter Standard für Feldbusverbindungen. Es wird von allen Arten von Hardware-Geräten wie Photovoltaik-Wechselrichter, elektrische Zähler, und so weiter verwendet.

source: https://en.wikipedia.org/wiki/Modbus[Modbus/TCP icon:external-link[]] for fieldbus connections via TCP/IP network.
de: https://en.wikipedia.org/wiki/Modbus [Modbus/TCP icon:external-link[]] für Feldbusverbindungen über das TCP/IP-Netzwerk.

source: https://en.wikipedia.org/wiki/Modbus[Modbus/RTU icon:external-link[]] for fieldbus connections via RS485 serial bus.
de: https://en.wikipedia.org/wiki/Modbus [Modbus/RTU icon:external-link[] für Feldbusverbindungen über den seriellen Bus RS485.

source: Build OpenEMS Edge
de: **OpenEMS Edge** läuft vor Ort und steuert die lokalen Geräte

source: Eclipse Export Wizard Selection assistant
de: Eclipse Export Wizard Selection Assistent

source: This creates a so called Fat-JAR-file including all bundles. It can be executed by running `java -jar openems.jar` in a console.
de: Dadurch wird eine sogenannte Fat-JAR-Datei erstellt, die alle Bundles enthält. Es kann ausgeführt werden, indem man ' java-jar openems.jar ' in einer Konsole läuft.

source: link:https://gradle.org/[Gradle] is a build tool that is used in the OpenEMS project to compile the JAR-files and to execute other tasks like building the documentation webpage using link:https://antora.org/[Antora] and the Javadocs. To build OpenEMS Edge:
de: link: https:/gradle.org/[Gradle] ist ein Build-Tool, das im OpenEMS-Projekt verwendet wird, um die JAR-Dateien zu kompilieren und andere Aufgaben auszuführen, wie zum Beispiel das Bauen der Dokumentations-Webseite mit link:https:/antora.org/[Antora] und die Javadocs. OpenEMS Edge zu bauen:

source: Execute `gradlew buildEdge`
de: Ausführung ' gradlew buildEdge '

source: OpenEMS Edge and Backend are configured using the standard OSGi configuration admin service. The easiest way to set a configuration is via the http://localhost:8080/system/console/configMgr[Apache Felix Web Console Configuration icon:external-link[]] as described in the xref:gettingstarted.adoc[Getting Started] guide above.
de: OpenEMS Edge und Backend werden mit dem Standard-OSGi-Konfigurationsadmin-Service konfiguriert. Der einfachste Weg, eine Konfiguration zu setzen, ist über das http://localhost:8080/system/console/configMgr[Apache Felix Web Console Configuration icon:external-link[]], wie oben im xref:gettingstarted.adoc[Getting Started]-Leitfaden beschrieben.

source: Apache Felix Web Console Configuration
de: Apache Felix Web-Konsolen-Konfiguration

source: Configuration via OpenEMS UI is currently not available due to the ongoing migration to xref:coreconcepts.adoc#_osgi_bundle[OSGi]. Once migration is finished, it is going to be possible to change every configuration using the settings menu in OpenEMS UI - directly to OpenEMS Edge and via Backend.
de: Die Konfiguration über OpenEMS UI ist derzeit aufgrund der fortschreitenden Migration zu xref: coreconcepts.adoc # _ osgi _ bundle [OSGi] nicht verfügbar. Sobald die Migration beendet ist, wird es möglich sein, jede Konfiguration über das Einstellungsmenü in OpenEMS UI zu ändern-direkt an OpenEMS Edge und über Backend.

source: OpenEMS UI Configuration
de: OpenEMS UI Screenshots

source: A OpenEMS Edge Controller holds the actual business logic or the actual algorithm that controls hardware. The logic of each active Controller is executed regularly on every Cycle, i.e. once per second.
de: Ein OpenEMS Edge Controller hält die eigentliche Geschäftslogik oder den eigentlichen Algorithmus, der Hardware steuert. Die Logik jedes aktiven Controllers wird regelmäßig auf jedem Zyklus ausgeführt, also einmal pro Sekunde.

source: Connects to OpenEMS Backend and sends all Channel data regularly. It is implemented as a Controller, as Channels can be written from OpenEMS Backend.
de: Verbindet sich mit OpenEMS Backend und sendet regelmäßig alle Channel-Daten. Es wird als Controller implementiert, da Channels von OpenEMS Backend geschrieben werden können.

source: Provides a Modbus-Slave implementation for OpenEMS Edge. It provides access to Channels from an external device via Modbus/TCP.
de: Bietet eine Modbus-Slave-Implementierung für OpenEMS Edge. Es ermöglicht den Zugriff auf Kanäle von einem externen Gerät über Modbus/TCP.

source: A REST-Api for external access to OpenEMS Edge. This Controller provides access to Channels and JSON-RPC Requests from an external device via JSON/REST.
de: Ein REST-Api für den externen Zugriff auf OpenEMS Edge. Dieser Controller ermöglicht den Zugriff auf Kanäle und JSON-RPC-Anfragen von einem externen Gerät über JSON/REST.

source: The default port for the server is *8084*; so the default base address for REST calls is `http://x:<PASSWORD>@<IP>:8084/rest`, where
de: Der Standard-Port für den Server ist * 8084 *; So lautet die Standard-Basisadresse für REST-Anrufe ' http:/x: <PASSWORD> @ <IP>: 8084/rest ', wo

source: `http` is the protocol
de: ' http ' ist das Protokoll

source: `x` is the user. Authentication in OpenEMS is via password only, so the username can be omitted.
de: "x" ist der Benutzer. Die Authentifizierung in OpenEMS erfolgt nur über ein Passwort, so dass der Benutzername weggelassen werden kann.

source: `<PASSWORD>` is the user password. If no specific settings have been made, try 'user' or 'admin' here.
de: "<PASSWORD>" ist das Passwort des Benutzers. Wenn keine bestimmten Einstellungen vorgenommen wurden, versuchen Sie hier ' Benutzer ' oder ' Admin '.

source: `8084` is the configured port
de: ' 8084 ' ist der konfigurierte Port

source: A good way to test REST-Api calls is via the Chrome extension https://chrome.google.com/webstore/detail/restlet-client-rest-api-t/aejoelaoggembcahagimdiliamlcdmfm[Restlet]
de: Eine gute Möglichkeit, REST-Api-Anrufe zu testen, ist über die Chrome-Erweiterung https://chrome.google.com/webstore/detail/restlet-client-rest-api-t/aejoelaoggembcahagimdiliamlcdmfm[Restlet]

source: For more information find the implementation https://github.com/OpenEMS/openems/tree/develop/io.openems.edge.controller.api.rest[Source Code icon:github[]].
de: Weitere Informationen finden Sie unter https://github.com/OpenEMS/openems/tree/develop/io.openems.edge.controller.api.rest [Source Code Symbol: github []].

source: Those are the available REST-Api endpoints:
de: Das sind die verfügbaren REST-Api-Endpunkte:

source: Endpoint `/rest/channel/<Component-ID>/<Channel-ID>`
de: Endpunkt '/rest/channel/<Component-ID>/<Channel-ID> '

source: `Component-ID` is the ID of the Component, e.g. "_sum", "ess0", "meter0",...
de: ' Component-ID ' ist die ID der Komponente, z.B. "_ sum", "ess0", "meter0",...

source: `Channel-ID` is the ID of the Channel, e.g. "ActivePowerL1", "Soc",...
de: ' Channel-ID ' ist die ID des Kanals, z.B. "ActivePowerL1", "Soc",...

source: Use a HTTP request with method `GET` to read the current value of a Channel.
de: Verwenden Sie eine HTTP-Anfrage mit der Methode ' GET ', um den aktuellen Wert eines Kanals zu lesen.

source: *Example:* To read the current state of charge of the battery, send a GET request to http://x:user@localhost:8084/rest/_sum/EssSoC. It returns a response like: ``` { "value": 50 } ```
de: * Beispiel: * Um den aktuellen Ladezustand der Batterie zu lesen, senden Sie eine GET-Anfrage an http://x:user@localhost:8084/rest/_sum/EssSoC. Es gibt eine Antwort wie: ``` { "Wert": 50 } ```

source: Use a HTTP request with method `POST` to write a Channel.
de: Verwenden Sie eine HTTP-Anfrage mit der Methode ' POST ', um einen Kanal zu schreiben.

source: *Example:* To switch a Digital-Output or Relay on, send a POST request to http://x:user@localhost:8084/rest/io0/Relay1 with the following body: ``` { "value": true } ```
de: * Beispiel: * Um eine Digital-Ausgabe oder Relay einzuschalten, senden Sie eine POST-Anfrage an http://x:user@localhost:8084/rest/io0/Relay1 mit folgendem Körper: ``` { "Wert": Stimmt } ```

source: Endpoint '/jsonrpc'
de: Endpunkt '/jsonrpc '

source: This allows remote procedure calls (RPC) using JSON-RPC. The JSON-RPC commands need to be sent as `POST` requests with the specified body.
de: Dies ermöglicht Fernabläufe (RPC) mit JSON-RPC. Die JSON-RPC-Befehle müssen als ' POST '-Anfragen mit dem angegebenen Körper gesendet werden.

source: JSON-RPC usually requires the properties 'id' and 'jsonrpc'. Those can be omitted here, as they are not required for HTTP POST calls.
de: JSON-RPC benötigt in der Regel die Eigenschaften ' ID ' und ' jsonrpc '. Diese können hier weggelassen werden, da sie bei HTTP-POST-Anrufen nicht benötigt werden.

source: Following JSON-RPC commands are available:
de: Folgende JSON-RPC-Befehle sind verfügbar:

source: Gets the current configuration of the OpenEMS Edge.
de: Erhält die aktuelle Konfiguration des OpenEMS Edge.

source: ``` { "method": "getEdgeConfig", "params": {} } ```
de: ``` { "Methode": "GetEdgeConfig", "Params": {{} } ```

source: componentJsonApi
de: EntjsonApi

source: Forwards a JSON-RPC payload to a given Component, identified by its Component-ID.
de: Schenkt eine JSON-RPC-Nutzlast an eine bestimmte Komponente weiter, die durch die Component-ID identifiziert wird.

source: Gets the currently active Modbus-TCP protocol definition from the Modbus-TCP-Api Controller with the ID "ctrlModbusTcp0".
de: Erhält die aktuell aktive Modbus-TCP-Protokolldefinition aus dem Modbus-TCP-Api-Controller mit der ID "ctrlModbusTcp0".

source: ``` { "method":"componentJsonApi", "params":{ "componentId":"ctrlApiModbusTcp0", "payload":{ "method":"getModbusProtocol", "params":{
de: ``` { "Methode": "KomponentJsonApi", "Params": { "componentId":"ctrlApiModbusTcp0", "Nutzlast": { "Methode": "getModbusProtocol", "Params": {
