Repository: OpenEMS/openems
Catalog: doc/modules/ROOT/pages/i18n/*.po
Languages: de

source: Updates a Component configuration.
de: Aktualisiert eine Komponentenkonfiguration.

source: ``` { "method": "updateComponentConfig", "params": { "componentId": "ctrlDebugLog0", "properties": [{ "name": "enabled", "value": true }] } } ```
de: ``` { "Methode": "updateComponentConfig", "Params": { "ComponentId": "ctrlDebugLog0", "Eigenschaften": [[ "Name": "Aktiviert", "Wert": Stimmt }] } } ```

source: Provides a JSON/REST implementation via HTTP Websocket for OpenEMS Edge. It provides access to Channels and JSON-RPC Requests from an external device via Websocket. This Controller is used for local connection of OpenEMS UI.
de: Bietet eine JSON/REST-Implementierung über HTTP-Websocket für OpenEMS Edge. Es ermöglicht den Zugriff auf Kanäle und JSON-RPC-Anfragen von einem externen Gerät über Websocket. Dieser Controller wird für die lokale Verbindung von OpenEMS UI verwendet.

source: Asymmetric Balancing Cos-Phi
de: Asymmetrischer Balancing Cos-Phi

source: Controls an asymmetric energy storage system in self-consumption optimization mode while keeping the grid meter on a defined cos-phi.
de: Steuert ein asymmetrisches Energiespeicher-System im Selbstverbrauchsoptimierungsmodus, während der Gittermesser auf einem definierten Cos-Phi gehalten wird.

source: Asymmetric Fix Active Power
de: Asymmetrische Fix Aktive Kraft

source: Sets a fixed active power for charging/discharging of an asymmetric energy storage system.
de: Setzt eine feste aktive Leistung für die Entsorgung eines asymmetrischen Energiespeichers.

source: Asymmetric Fix Reactive Power
de: Asymmetrische Fix Reaktive Kraft

source: Sets a fixed reactive power for an asymmetric energy storage system.
de: Setzt eine feste Reaktionsleistung für einen asymmetrischen Energiespeicher.

source: Asymmetric Phase Rectification
de: Asymmetrische Phasenrezertifizierung

source: Balances the three phases at the grid using an asymmetric energy storage system.
de: Bilden Sie die drei Phasen des Netzes mit einem asymmetrischen Energiespeicher.

source: Channel-Threshold
de: Kanaldrohold

source: Generic Controller that sets a digital output according to the value of given Channel - e.g. turn a Relay on, when battery state of charge is above a given threshold.
de: Generischer Controller, der eine digitale Ausgabe nach dem Wert des gegebenen Kanals setzt-z.B. ein Relay einschalten, wenn der Batteriezustand über einer bestimmten Schwelle liegt.

source: CHP control via State-of-Charge (SoC)
de: BHK-Steuerung über State-of-Charge (SoC)

source: Controls a CHP device. Signals the CHP to turn on when battery SoC is low; signal it to turn off when SoC is high.
de: Steuert ein KWK-Gerät. Signalisiert, dass die KWK eingeschaltet werden soll, wenn die Batterie SoC niedrig ist; Signalisieren Sie es, um auszuschalten, wenn SoC hoch ist.

source: Detailed Debug Log
de: Detailliertes Debug-Log

source: Constantly shows the values of all Channels of a Component on the console. Primarily used for developing and debugging.
de: Zeigt ständig die Werte aller Kanäle eines Bauteils auf der Konsole an. Vor allem für die Entwicklung und Fehlersuche.

source: Debug Log
de: Debug Log (Fehlerprotokoll)

source: Constantly shows the most important values of all Components on the console. This is often activated by default to be able to track the running system easily.
de: Zeigt ständig die wichtigsten Werte aller Komponenten auf der Konsole. Dies wird oft standardmäßig aktiviert, um das laufende System leicht verfolgen zu können.

source: ESS Discharge Limit Considering Cell Voltage
de: ESS-Diskostenlimit bei Cell Voltage

source: Limit discharge of an energy storage system depending on cell voltages.
de: Grenzentladung eines Energiespeichers je nach Zellspannungen.

source: Switches an AC PV inverter to the emergency power on grid outage.
de: Schaltet einen AC-PV-Wechselrichter bei Netzausfall in die Notstromversorgung.

source: ESS Limit Total Discharge
de: ESS-Limit Total abgabe

source: Limits the discharge power of an energy storage system according to its State-of-Charge, e.g. to keep energy for emergency power or to avoid deep discharge.
de: Limitiert die Entladungsleistung eines Energiespeichers nach seinem Ladezustand, z.B. um Energie für Notstromversorgung zu halten oder um eine tiefe Entladung zu vermeiden.

source: ESS One Full Cycle
de: ESS Ein vollwertiges Rad

source: Executes a full charge/discharge cycle with an energy storage system. This can be used to let the Battery Management System (BMS) reset its reference points for State-of-Charge calculattion.
de: Führt einen kompletten Ladezyklus mit einem Energiespeicher durch. Damit kann das Batteriemanagementsystem (BMS) seine Bezugspunkte für die Berechnung der Ladezustände zurücksetzen.

source: Controls an Electric Vehicle Charging Station (EVCS) in different modes, like "Force-Charge" and "Surplus Energy Charging".
de: Steuert eine Elektrofahrzeug-Ladestation (EVCS) in verschiedenen Modi, wie "Force-Charge" und "Surplus Energy Charging".

source: Sets a fixed maximum charge power to an Electric Vehicle Charging Station (EVCS).
de: Setzt eine feste maximale Ladeleistung an eine elektrische Fahrzeugladestation (EVCS).

source: High-Load Timeslot
de: Hochladenzeitplan

source: Controls an energy storage system for a High-Load timeslot application (German "Hochlastzeitfenster").
de: Steuert ein Energiespeicher-System für eine High-Load-Zeitlauf-Anwendung (Hochlastzeitfenster).

source: Switches a digital output, when one or more State-Channels are set. Can be used to signal alarms.
de: Schaltet eine digitale Ausgabe, wenn ein oder mehrere State-Kanäle gesetzt sind. Kann verwendet werden, um Alarme zu signalisieren.

source: Sets a digital output statically ON or OFF.
de: Setzt einen digitalen Ausgang statisch ein oder aus.

source: PV-Inverter Fix Power Limit
de: PV-Wechselrichter fixieren Power Limit

source: Sets a fixed power limit for PV-Inverter production.
de: Setzt ein festes Leistungslimit für die PV-Wechselriter-Produktion.

source: Symmetric Balancing
de: Symmetrisches Balancing

source: Controls a symmetric energy storage system in self-consumption optimization mode.
de: Steuert ein symmetrisches Energiespeicher im Eigenverbrauchsoptimierungsmodus.

source: Symmetric Balancing Schedule
de: Symmetrisches Balancing-Programm

source: Controls a symmetric energy storage system in self-consumption optimization mode. Allows the definition of a Schedule to set the target power on the grid meter. This Controller can be controlled using the OpenEMS Backend-to-Backend interface.
de: Steuert ein symmetrisches Energiespeicher im Eigenverbrauchsoptimierungsmodus. Ermöglicht die Definition eines Zeitplans, um die Zielleistung auf dem Netzmeter einzustellen. Dieser Controller kann über die OpenEMS Backend-to-Backend-Schnittstelle gesteuert werden.

source: Symmetric Fix Active Power
de: Symmetrische Fix Aktive Kraft

source: Sets a fixed active power for charging/discharging of a symmetric energy storage system.
de: Setzt eine feste aktive Leistung für die Ladung eines symmetrischen Energiespeichers.

source: Symmetric Fix Reactive Power
de: Symmetrische Fix Reaktive Kraft

source: Sets a fixed reactive power for a symmetric energy storage system.
de: Setzt eine feste Reaktionsleistung für ein symmetrisches Energiespeicher.

source: Symmetric Limit Active Power
de: Symmetrische Limit Aktive Kraft

source: Limits the allowed active power for charging and discharging of a symmetric energy storage system.
de: Limits die zulässige aktive Leistung zum Aufladen und Entladen eines symmetrischen Energiespeichers.

source: Symmetric Linear Power Band
de: Symmetrische Linearkraftband

source: Executes a test cycle for a symmetric energy storage system by increasing and decreasing the charging/discharging power in given limits.
de: Führt einen Testzyklus für ein symmetrisches Energiespeicher-System durch, indem die Ladekraft in vorgegebenen Grenzen erhöht und verringert wird.

source: Symmetric Peak-Shaving
de: Symmetrischer Peak-Shaving

source: Applies peak-shaving at the grid using a symmetric energy storage system.
de: Mit Hilfe eines symmetrischen Energiespeichers wird die Peak-Rasitur am Gitter eingesetzt.

source: Symmetric Random-Power
de: Symmetrische Random-Power

source: Applies random charging/discharging of a symmetric energy storage system for performance tests.
de: Gilt die zufällige Befladung eines symmetrischen Energiespeichers für Leistungstests.

source: Symmetric Reactive-Power Voltage-Characteristics
de: Symmetrische Reaktions-und Kraft-Voltage-Charakteristik

source: Controls a symmetric energy storage system using a Q-by-U reference function.
de: Steuert ein symmetrisches Energiespeicher-System mit einer Q-by-U-Referenzfunktion.

source: This chapter explains how OpenEMS can be deployed on a Debian Linux Internet-of-Things Gateway. Similar techniques will work for other operating systems as well.
de: In diesem Kapitel wird erklärt, wie OpenEMS auf einem Debian Linux Internet-of-Things Gateway eingesetzt werden kann. Ähnliche Techniken werden auch für andere Betriebssysteme funktionieren.

source: This guide covers a simple, manual approach. For productive systems it is required to automate deployment to IoT devices. Good approaches include a Debian package repository that provides *.deb-files and third-party tools like http://www.eclipse.org/hawkbit/[Eclipse Hawkbit]. This is out-of-scope for this small guide.
de: Diese Anleitung umfasst einen einfachen, manuellen Ansatz. Für produktive Systeme ist es erforderlich, den Einsatz auf IoT-Geräten zu automatisieren. Gute Ansätze sind ein Debian-Paket-Projektarchiv, das * .deb-Dateien und Drittanbieter-Tools wie http://www.eclipse.org/hawkbit/[Eclipse Hawkbit] zur Verfügung stellt. Das ist für diesen kleinen Leitfaden nicht möglich.

source: Prerequisites:
de: Voraussetzungen:

source: A target device running Debian Linux like a Raspberry Pi, Beaglebone Black or an IoT gateway. You need the IP address and SSH access.
de: Ein Zielgerät, das Debian Linux wie ein Raspberry Pi, Beaglebone Black oder ein IoT-Gateway betreibt. Sie benötigen die IP-Adresse und den SSH-Zugang.

source: Create a JAR-file that should be deployes. See xref:edge/build.adoc[Build OpenEMS Edge] for details.
de: Erstellen Sie eine JAR-Datei, die eingestellt werden soll. Weitere Informationen finden Sie unter xref: edge/build.adoc [Build OpenEMS Edge].

source: Setup an SSH client to connect to the Linux console, e.g. http://www.9bis.net/kitty/[KiTTY]
de: Richten Sie einen SSH-Client ein, um sich mit der Linux-Konsole zu verbinden, z.B. http://www.9bis.net/kitty/[KiTTY]

source: Setup an SCP client to copy the JAR file via SSH, e.g. https://winscp.net/eng/docs/lang:de[WinSCP]
de: Setup eines SCP-Clients, um die JAR-Datei über SSH zu kopieren, z.B. https:/winscp.net/docs/lang: de [WinSCP]

source: Connect via SSH and SCP
de: Verbinden Sie sich über SSH und SCP

source: Connect via SSH using KiTTY
de: Verbinden Sie sich über SSH mit KiTTY

source: Open KiTTY and connect to the target device.
de: Öffnen Sie KiTTY und verbinden Sie sich mit dem Zielgerät.

source: Make sure to select SSH with port 22 and enter the IP address of the target device. Press the btn:[Open] button.
de: Stellen Sie sicher, dass Sie SSH mit Port 22 auswählen und die IP-Adresse des Zielgerätes eingeben. Drücken Sie den btn: [Öffnen] Knopf.

source: KiTTY Configuration
de: KiTTY-Konfiguration

source: Gain root permissions either by logging in as user *root* or by login in as a default user and executing *sudo -s*.
de: Gewinnen Sie Root-Berechtigungen entweder, indem Sie sich als Benutzer * root * einloggen oder indem Sie sich als Standard-Benutzer anmelden und * sudo-s * ausführen.

source: As an example, for the FENECON Energy Management System (FEMS) it is required to: + _login as:_ `fems` + _fems@192.168.178.38's password:_ `device specific password` + ... + _fems@femsXXX:~$_ `sudo -s` + _[sudo] password for fems:_ `device specific password` + _root@femsXXX:/home/fems#_
de: Für das FENECON Energy Management System (FEMS) ist es beispielsweise erforderlich: + _ login as: _ ' fems ' + _fems@192.168.178.38's password: _ ' device specific password ' + ... + _ fems @ femsXXX: ~ $ _ ' sudo-s ' + _ [sudo] password for fems: _ ' device specific password ' + root @ femsXXX:/home/fems # _

source: Connect via SCP using WinSCP
de: Verbinden Sie sich über SCP mit WinSCP

source: If you are lucky and have a fully configured system, right-click on the KiTTY window bar and select btn:[Start WinSCP].
de: Wenn Sie Glück haben und ein voll konfiguriertes System haben, klicken Sie mit der rechten Maustaste auf die KiTTY-Fensterleiste und wählen Sie btn: [Starten Sie WinSCP].

source: Start WinSCP from KiTTY
de: WinSCP von KiTTY starten

source: Otherwise open WinSCP separately, create a new connection, select *SCP* as protocol and enter again the IP address and port 22. Click btn:[Connect] once finished.
de: Ansonsten öffnen Sie WinSCP separat, erstellen Sie eine neue Verbindung, wählen Sie * SCP * als Protokoll und geben Sie die IP-Adresse und den Port 22 wieder ein. Klicken Sie auf btn: [Connect], sobald sie fertig sind.

source: Create the directory */usr/lib/openems*. This is going to be the place, where we put the JAR file.
de: Erstellen Sie das Verzeichnis */usr/lib/openems *. Dies wird der Ort sein, an dem wir die JAR-Datei stellen.

source: Execute `mkdir /usr/lib/openems`.
de: Führt ' mkdir/usr/lib/openems ' aus.

source: Create the directory */etc/openems.d*. This is going to be the place, where all the bundle configurations are held.
de: Erstellen Sie das Verzeichnis */etc/openems.d *. Dies wird der Ort sein, an dem alle Bündelkonfigurationen stattfinden.

source: Execute `mkdir /etc/openems.d`.
de: Ausführbar ' mkdir/etc/openems.d '.

source: The systemd 'Service Manager' manages system processes in a Debian Linux. We will create a systemd service definition file, so that systemd takes care of managing (starting/restarting/...) the OpenEMS Edge service.
de: Der Systemd ' Service Manager ' verwaltet Systemprozesse in einem Debian Linux. Wir werden eine Systemd-Service-Definition-Datei erstellen, so dass sich systemd um die Verwaltung (starting/restarting/...) des OpenEMS Edge Service kümmert.

source: Execute `nano /etc/systemd/system/openems.service`
de: Ausführbar ' nano/etc/systemd/systemd/openems.service '

source: [Service] User=root <3> Group=root Type=notify <4> WorkingDirectory=/usr/lib/openems LimitCORE=infinity LimitRTPRIO=2 LimitRTTIME=60000000 CPUSchedulingPolicy=rr CPUSchedulingPriority=1 ExecStart=/usr/bin/java -Dfelix.cm.dir=/etc/openems.d/ -jar /usr/lib/openems/openems.jar <5> SuccessExitStatus=143 <6> Restart=always <7> RestartSec=10 <8> WatchdogSec=60 <9>
de: [Service] User = root <3> Gruppe = Wurzel Type = benachrichtigen <4> Working-Verzeichnis =/usr/lib/openems LimitCORE = Unendlichkeit LimitRTPRIO=2 LimitRTTIME=60000000 CPUSchedulingPolicy = rr CPUSchedulingPriority=1 Es ist nicht so, dass es sich um ein-Dfelix.cm.dir um ein sehr schönes und sehr schönes Hotel handelt <5> Erfolgs-ExitStatus=143 <6> Neustart = immer <7> RestartSec=10 <8> WatchdogSec=60 <9>

source: OpenEMS notifies systemd once it is started up properly.
de: OpenEMS meldet systemd, sobald es richtig gestartet ist.

source: The start command. It uses Java 8, sets the config directory to `/etc/openems.d` and runs the jar file at `/usr/lib/openems/openems.jar`
de: Der Startbefehl. Es verwendet Java 8, setzt das Konfigurationsverzeichnis auf '/etc/openems.d ' und führt die jar-Datei unter '/usr/lib/openems/openems.jar ' aus.

source: Systemd _always_ tries to restart OpenEMS once it was quit.
de: Systemd _ always _ tries to restart OpenEMS once that once it be quitit.

source: Systemd expects OpenEMS to trigger its watchdog once every 60 seconds. OpenEMS is doing that by default if it detects that it is run by systemd.
de: Systemd erwartet, dass OpenEMS seinen Watchdog einmal alle 60 Sekunden auslöst. OpenEMS tut das standardmäßig, wenn es feststellt, dass es von systemd ausgeführt wird.

source: Update OpenEMS Edge JAR file
de: **OpenEMS Edge** läuft vor Ort und steuert die lokalen Geräte

source: To update the OpenEMS JAR file at the target device, it is required to copy the JAR file from your build directory (see xref:edge/build.adoc[Build OpenEMS Edge]) to `/usr/lib/openems/openems.jar` on the target device. Afterwards it is required to restart the systemd service
de: Um die OpenEMS-JAR-Datei auf dem Zielgerät zu aktualisieren, ist es erforderlich, die JAR-Datei aus Ihrem Build-Verzeichnis zu kopieren (siehe xref: edge/build.adoc [Build OpenEMS Edge]) auf '/usr/lib/openems/openems/openems.jar ' auf dem Zielgerät. Danach ist es erforderlich, den systemd-Dienst neu zu starten

source: Copy JAR file via SCP.
de: Kopieren Sie JAR-Datei über SCP.

source: In WinSCP open your local build directory on the left side and */usr/lib/openems/* on the right side. Then drag and drop the file from left to right.
de: In WinSCP öffnen Sie Ihr lokales Build-Verzeichnis auf der linken Seite und */usr/lib/openems/* auf der rechten Seite. Dann ziehen und lassen Sie die Datei von links nach rechts.

source: WinSCP copy file
de: WinSCP-Kopierdatei

source: Restart OpenEMS systemd service.
de: Starten Sie den OpenEMS-Systemd-Service neu.

source: Execute `systemctl restart openems --no-block; journalctl -lfu openems`
de: Führt ' systemctl restart openems--no-block; Journalctl-lfu-openems '

source: The command restarts the service (_systemctl restart openems_) while not waiting for the OpenEMS startup notification (_--no-block_). Then it directly prints the OpenEMS system log (_journalctl -lfu openems_).
de: Der Befehl startet den Dienst neu (_ systemctl starten openems _), während er nicht auf die OpenEMS-Start-Benachrichtigung (_--no-block _) wartet. Dann druckt es direkt das OpenEMS-Systemprotokoll (_ journalctl-lfu openems _).

source: OpenEMS Edge start-up
de: **OpenEMS Edge** läuft vor Ort und steuert die lokalen Geräte

source: For the following devices driver implementations are available in OpenEMS Edge.
de: Für die folgenden Geräte sind Treiber-Implementierungen in OpenEMS Edge verfügbar.

source: Implemented Natures
de: Implementation Natures

source: SymmetricEss
de: SymmetrikEss

source: (proprietary)
de: (Eigene)

source: Soltaro Battery Rack
de: Soltaro Batterie-Rack

source: Battery
de: Batterie

source: Combines multiple energy storage systems (ESS) to one common ESS. This way every Controller can easily work with multiple ESS in parallel. Distribution of power requests to each ESS is controlled via the https://github.com/OpenEMS/openems/tree/develop/io.openems.edge.ess.core/src/io/openems/edge/ess/core/power[Power-Class icon:github[]].
de: Kombiniert mehrere Energiespeicher (ESS) zu einer gemeinsamen ESS. So kann jeder Controller einfach mit mehreren ESS parallel arbeiten. Die Verteilung der Stromanfragen an jeden ESS wird über das https://github.com/OpenEMS/openems/tree/develop/io.openems.edge.ess.core/src/io/openems/edge/ess/core/power [Power-Klasse-Symbol: github []] gesteuert.

source: REFU Battery Inverter
de: REFU Batterie-Wechselrichter

source: Project specific implementation of a REFU inverter. This will not directly apply to all REFU battery inverters.
de: Projektspezifische Umsetzung eines REFU-Wechselrichters. Dies gilt nicht direkt für alle REFU-Batterie-Wechselrichter.

source: Sinexcel Battery Inverter
de: Sinexcel Batterie-Wechselrichter

source: KEBA KeContact c-series Charging Station
de: KEBA KeContact C-Serie Ladestation

source: Evcs (Electric Vehicle Charging Station)
de: Evcs (Elektrofahrzeug-Ladestation)

source: Applies to multiple similar products like the FENECON by BYD PRO Hybrid.
de: Gilt für mehrere ähnliche Produkte wie die FENECON von BYD PRO Hybrid.

source: AsymmetricMeter (for Grid and AC-connected PV)
de: AsymmetricMeter (für Gitter-und AC-angeschlossener PV)

source: SymmetricMeter (for Grid and AC-connected PV)
de: SymmetricMeter (für Gitter und AC-angeschlossener PV)

source: SymmetricMeter (for Grid and PV)
de: SymmetricMeter (für Gitter und PV)

source: AsymmetricMeter (for PV)
de: AsymmetricMeter (für PV)

source: SymmetricMeter (for PV)
de: SymmetricMeter (für PV)

source: SymmetricMeter (for Grid meter)
de: SymmetricMeter (für Gittermesser)

source: EssDcCharger (for PV)
de: EssDcCharger (für PV)

source: Microcare SDM 630 Meter
de: Mikrocare SDM 630 Meter

source: This implementation is functionally compatible with a number of energy meters with the name "SDM 630".
de: Diese Implementierung ist funktionell kompatibel mit einer Reihe von Energiezählern mit dem Namen "SDM 630".

source: Virtual Symmetric Add
de: Virtuelle Symmetrie

source: Persists all data of OpenEMS Edge Channels to an InfluxDB timeseries database.
de: Behält alle Daten von OpenEMS Edge Channels in einer InfluxDB-Zeitreihendatenbank bei.

source: Implementing a device
de: Einführung eines Gerätes

source: Step-by-step guide
de: Schritt-für-Schritt-Leitfaden

source: This chapter explains the steps required to implement a meter in OpenEMS Edge that is connected via Modbus/TCP. The meter itself is simulated using a small Modbus slave application, so no external hardware is required for this guide.
de: In diesem Kapitel werden die Schritte erläutert, die erforderlich sind, um einen Zähler in OpenEMS Edge zu implementieren, der über Modbus/TCP verbunden ist. Der Zähler selbst wird mit einer kleinen Modbus-Slave-Anwendung simuliert, so dass für diese Anleitung keine externe Hardware benötigt wird.

source: The tutorial is based on the xref:gettingstarted.adoc[Getting Started] guide.
de: Das Tutorial basiert auf dem Leitfaden xref: gettingstarted.adoc [Getting Started].

source: In this guides you will create different classes, these classes may create some errors. These errors will solve themselves within the progress of the guide because the classes are interdependent.
de: In diesen Führungen werden verschiedene Klassen erstellt, diese Klassen können einige Fehler erzeugen. Diese Fehler lösen sich innerhalb des Fortschritts des Leitfadens, weil die Klassen voneinander abhängig sind.

source: Create a new OSGi Bundle
de: Ein neues OSGi-Bundle erstellen

source: For more information see xref:coreconcepts.adoc#_osgi_bundle[OSGi Bundle].
de: Weitere Informationen finden Sie unter xref: coreconcepts.adoc # _ osgi _ bundle [OSGi Bundle].

source: In the menu choose btn:[File] -> btn:[New] -> btn:[Other]
de: Im Menü wählen btn: [Datei]-> btn: [Neu]-> btn: [Andere]

source: Creating a new project in Eclipse IDE
de: Neues Projekt in Eclipse IDE erstellen

source: Select btn:[Bndtools] -> btn:[Bnd OSGi Project] and press btn:[Next >]
de: Wählen Sie btn: [Bndtools]-> btn: [Bnd OSGi Project] und drücken Sie btn: [Weiter >]

source: Creating a Bnd OSGi Project in Eclipse IDE
de: Ein Bnd OSGi-Projekt in Eclipse IDE

source: Select btn:[OSGi enRoute] -> btn:[Provider/Adapter Bundle] and press btn:[Next >]
de: Wählen Sie btn: [OSGi enRoute]-> btn: [Provider/Adapter Bundle] und drücken btn: [Weiter >]

source: Technically an OpenEMS Edge Device provides implementations of the interfaces of an OSGi _API Bundle_. In OSGi terminology this is called a _Provider/Adapter Bundle_
de: Technisch bietet ein OpenEMS Edge Device Implementierungen der Schnittstellen eines OSGi _ API Bundle _. In der OSGi-Terminologie wird dies als ein _ Provider/Adapter Bundle _ bezeichnet.

source: Creating a Bnd OSGi Provider/Adapter Bundle in Eclipse IDE
de: Erstellung eines Bnd OSGi Provider/Adapter-Bundle in Eclipse IDE

source: Choose a project name and press btn:[Next >]
de: Wählen Sie einen Projektnamen und drücken Sie btn: [Weiter >]
