Repository: OpenEMS/openems
Catalog: doc/modules/ROOT/pages/i18n/*.po
Languages: de

source: The project name is used as the folder name in OpenEMS source directory. The naming is up to you, but it is good practice to keep the name lower case and use something like *io.openems.[edge/backend].[purpose/nature].[implementation]*. For the simulated meter `io.openems.edge.meter.simulated` is a good choice.
de: Der Projektname wird als Ordnername im OpenEMS-Quellverzeichnis verwendet. Die Namensgebung liegt bei Ihnen, aber es ist eine gute Praxis, den Namen im Kleinbuchstaben zu behalten und so etwas wie * io.openems zu verwenden. [edge/backend]. [Purpose/nature]. [Umsetzung] *. Für den simulierten Zähler ist ' io.openems.edge.meter.simulated eine gute Wahl.

source: Naming a Bnd OSGi Provider/Adapter Bundle in Eclipse IDE
de: Benennung eines Bnd OSGi Provider/Adapter-Bundle in Eclipse IDE

source: Accept defaults for the final screen and press btn:[Finish]
de: Nehmen Sie die Voreinstellungen für den letzten Bildschirm an und drücken Sie btn: [Ziel]

source: Java settings for a Bnd OSGi Provider/Adapter Bundle in Eclipse IDE
de: Java-Einstellungen für ein Bnd OSGi Provider/Adapter-Bundle in Eclipse IDE

source: The assistant closes and you can see your new bundle.
de: Der Assistent schließt und Sie können Ihr neues Bündel sehen.

source: Define Bundle dependencies
de: Bündel-Abhängigkeiten definieren

source: OSGi Bundles can be dependent on certain other Bundles. This information needs to be set in a *bnd.bnd* file.
de: OSGi-Bundles können von bestimmten anderen Bundles abhängig sein. Diese Informationen müssen in einer * bnd.bnd *-Datei gesetzt werden.

source: Select the component directory btn:[src] -> btn:[io.openems.edge.meter.simulated]
de: Wählen Sie das Komponentenverzeichnis btn: [src]-> btn: [io.openems.edge.meter.simulated]

source: New simulated meter Bnd OSGi Provider/Adapter Bundle in Eclipse IDE
de: Neuer simulierter Zähler Bnd OSGi Provider/Adapter Bundle in Eclipse IDE

source: Open the btn:[bnd.bnd] file by double clicking on it.
de: Öffnen Sie die btn: [bnd.bnd]-Datei, indem Sie mit einem Doppelklick darauf klicken.

source: Open the btn:[Build] tab
de: Öffnen Sie die tn: [Build] Tab

source: You can see, that the Bundle is currently dependent on a core OSGi API bundle ('osgi.enroute.base.api'). We are going to expand that list.
de: Sie können sehen, dass das Bundle derzeit von einem Kern-OSGi-API-Bundle (' osgi.enroute.base.api ') abhängig ist. Wir werden diese Liste erweitern.

source: Bndtools Build configuration
de: Bndtools Build Konfiguration

source: Click the btn:[+] symbol next to *Build Path*.
de: Klicken Sie auf das btn: [+]-Symbol neben * Bauen Sie Pfad *.

source: Bndtools Build Path configuration
de: Bndtools Build Path Konfiguration

source: Use the *Project Build Path* assistant to add the following Bundles as dependencies:
de: Verwenden Sie den * Project Build Path *-Assistenten, um die folgenden Bundles als Abhängigkeiten hinzuzufügen:

source: The Edge Common Bundle provides implementations and services that are common to all OpenEMS Edge components.
de: Das Edge Common Bundle bietet Implementierungen und Services, die allen OpenEMS Edge-Komponenten gemeinsam sind.

source: The Meter API Bundle provides the interfaces for OpenEMS Edge Meter Nature.
de: Das Meter API Bundle bietet die Schnittstellen für OpenEMS Edge Meter Nature.

source: The Modbus Bundle provides the Bridge services for Modbus/RTU and Modbus/TCP protocols.
de: Das Modbus Bundle bietet die Bridge-Dienste für Modbus/RTU und Modbus/TCP-Protokolle.

source: It is also a good moment to configure the Bundle meta information. Still inside the btn:[bnd.bnd] file open the btn:[Source] tab. Add some meta information - it will help the users of your component:
de: Es ist auch ein guter Moment, um die Meta-Informationen von Bundle zu konfigurieren. Noch in der btn: [bnd.bnd]-Datei öffnen Sie die tn: [Source] Registerkarte.

source: Bundle-Name: OpenEMS Edge Meter Simulated Bundle-Vendor: OpenEMS Association e.V. Bundle-License: https://opensource.org/licenses/EPL-2.0 Bundle-Version: 1.0.0.${tstamp} Export-Package: \ io.openems.edge.meter.api,\ io.openems.edge.meter.asymmetric.api,\ io.openems.edge.meter.symmetric.api Private-Package: io.openems.edge.meter.simulated
de: Bundle-Name: OpenEMS Edge Meter Simulated Bundle-Vendor: OpenEMS Association e.V. Bundle-License: https://opensource.org/licenses/EPL-2.0 Bundle-Version: 1.0.0.${tstamp} Export-Paket: \ io.openems.edge.meter.api,\ io.openems.edge.meter.asymmetric.api,\ io.openems.edge.meter.symmetric.api Privatpaket: io.openems.edge.meter.simulated

source: -includeresource: {readme.md}
de: -inkluderesource: {readme.md}

source: -buildpath: ${buildpath},\ io.openems.common;version=latest,\ io.openems.edge.common;version=latest,\ io.openems.edge.controller.api;version=latest,\ io.openems.edge.ess.api;version=latest,\ com.google.guava,\ slf4j.api
de: -buildpath: $ {buildpath}, \ io.openems.common; Version = aktuell, \ io.openems.edge.common; Version = aktuell, \ io.openems.edge.controller.api; Version = aktuell, \ io.openems.edge.ess.api; Version = aktuell, \ com.google.guava,\ Slf4j.api

source: Define configuration parameters
de: Konfigurationsparameter festlegen

source: OpenEMS Components can have several configuration parameters. They are defined as Java annotations and specific OSGi annotations are used to generate meta information that is used e.g. by Apache Felix Web Console to generate a user interface form (see xref:gettingstarted.adoc[Getting Started]).
de: OpenEMS Components kann mehrere Konfigurationsparameter haben. Sie werden als Java-Anmerkungen definiert und spezifische OSGi-Anmerkungen werden verwendet, um Meta-Informationen zu generieren, die z.B. von Apache Felix Web Console verwendet werden, um ein Benutzeroberfläche-Formular zu generieren (siehe xref: gettingingstarted.adoc [Getting Started]).

source: Make sure that the component directory is still selected.
de: Stellen Sie sicher, dass das Komponentenverzeichnis noch ausgewählt ist.

source: Select btn:[Java] -> btn:[Other...] and press btn:[Next >]
de: Wählen Sie btn: [Java]-> btn: [Other ...] and press btn: [Next >]

source: Creating a Java annotation in Eclipse IDE
de: Erstellung einer Java-Notiz in Eclipse IDE

source: Set the name *Config* press btn:[Finish].
de: Setzen Sie den Namen * Config * press btn: [Finish].

source: Creating the Java annotation 'Config' in Eclipse IDE
de: Erstellung der Java-Anmerkung ' Config ' in Eclipse IDE

source: A Java annotation template was generated for you:
de: Für Sie wurde eine Java-Anmerkungen-Vorlage erstellt:

source: package io.openems.edge.meter.simulated;
de: Paket io.openems.edge.meter.simulated;

source: public interface Config {
de: Öffentliche Schnittstelle Config {

source: Adjust the template to match the following code:
de: Passen Sie die Vorlage an den folgenden Code an:

source: import org.osgi.service.metatype.annotations.AttributeDefinition; import org.osgi.service.metatype.annotations.ObjectClassDefinition;
de: org.osgi.service.metatype.annotations.AttributeDefinition importieren; org.osgi.service.metatype.annotations.ObjectClassDefinition importieren;

source: import io.openems.edge.meter.api.MeterType;
de: io.openems.edge.meter.api.MeterType importieren;

source: @ObjectClassDefinition( // <1> name = "Meter Simulated", // description = "Implements the simulated meter.") @interface Config {
de: @ObjectClassDefinition (/<1> Name = "Meter Simulated",// Beschreibung = "Implements the simulated meter.") @interface Config {

source: @AttributeDefinition(name = "Component-ID", description = "Unique ID of this Component") String id() default "meter0"; // <2>
de: @AttributeDefinition (Name = "Component-ID", Beschreibung = "Einzigartige ID dieser Komponente") String id () default "meter0"; <2>

source: @AttributeDefinition(name = "Alias", description = "Human-readable name of this Component; defaults to Component-ID") String alias() default ""; // <3>
de: @AttributeDefinition (Name = "Alias", Beschreibung = "Menschenlesbarer Name dieser Komponente; Standardeinstellungen auf Component-ID ") String alias () default ""; <3>

source: @AttributeDefinition(name = "Is enabled?", description = "Is this Component enabled?") boolean enabled() default true; // <4>
de: @AttributeDefinition (Name = "Ist aktiviert?", Beschreibung = "Ist diese Komponente aktiviert?") Boolean enabled () default true; <4>

source: @AttributeDefinition(name = "Meter-Type", description = "Grid, Production (=default), Consumption") // <5> MeterType type() default MeterType.PRODUCTION; // <6>
de: @AttributeDefinition (Name = "Meter-Typ", Beschreibung = "Grid, Produktion (= Standard), Konsum")//<5> MeterType Typ () Standard MeterType.PRODUCTION; <6>

source: @AttributeDefinition(name = "Modbus-ID", description = "ID of Modbus bridge.") String modbus_id(); // <7>
de: @AttributeDefinition (Name = "Modbus-ID", Beschreibung = "ID of Modbus bridge.") String modbus _ id (); <7>

source: @AttributeDefinition(name = "Modbus Unit-ID", description = "The Unit-ID of the Modbus device.") int modbusUnitId(); // <8>
de: @AttributeDefinition (Name = "Modbus Unit-ID", Beschreibung = "Die Einheit-ID des Modbus-Gerätes.") int modbusUnitId (); <8>

source: @AttributeDefinition(name = "Modbus target filter", description = "This is auto-generated by 'Modbus-ID'.") String Modbus_target() default ""; // <9>
de: @AttributeDefinition (Name = "Modbus-Zielfilter", Beschreibung = "Das wird automatisch generiert durch ' Modbus-ID '.") String Modbus _ target () default ""; <9>

source: The *@ObjectClassDefinition* annotation defines this file as a Meta Type Resource for OSGi configuration admin. Use it to set a _name_ and _description_ for this OpenEMS Component.
de: Die * @ObjectClassDefinition *-Anmerkung definiert diese Datei als Meta-Type-Ressource für OSGi-Konfigurationsadmin. Verwenden Sie es, um a _ name _ and _ description _ für diese OpenEMS-Komponente zu setzen.

source: The *id* configuration parameter sets the OpenEMS Component-ID (see xref:coreconcepts.adoc[Channel Adress]). _Note_: A *default* ID 'meter0' is defined. It is good practice to define such an ID here, as it simplifies configuration in the UI.
de: Der * id *-Konfigurationsparameter setzt die OpenEMS Component-ID (siehe xref: coreconcepts.adoc [Channel Adress]). _ Note _: A * default * ID ' meter0 ' ist definiert. Es ist eine gute Praxis, eine solche ID hier zu definieren, da sie die Konfiguration im UI vereinfacht.

source: The *alias* configuration parameter sets the human-readable name of this OpenEMS Component. If no alias is configured, the Component-ID is used instead.
de: Der * alias *-Konfigurationsparameter legt den menschlich lesbaren Namen dieser OpenEMS-Komponente fest. Wenn kein Alias konfiguriert ist, wird stattdessen die Component-ID verwendet.

source: The *enabled* parameter provides a _soft_ way of deactivating an OpenEMS Component programmatically.
de: Der * enabled *-Parameter bietet eine _ soft _ Möglichkeit, eine OpenEMS-Komponente programmatisch zu deaktivieren.

source: The *@AttributeDefinition* annotation provides meta information about a configuration parameter like _name_ and _description_.
de: Die * @AttributeDefinition *-Annotation liefert Meta-Informationen über einen Konfigurationsparameter wie _ name _ and _ description _.

source: The 'Meter' nature requires definition of a MeterType that defines the purpose of the Meter. We will let the user define this type by a configuration parameter.
de: Die ' Meter '-Natur erfordert die Definition eines MeterType, der den Zweck des Meters definiert. Wir lassen den Benutzer diesen Typ durch einen Konfigurationsparameter definieren.

source: The 'Modbus-ID' parameter creates the link to a Modbus-Service via its OpenEMS Component-ID. At runtime the user will typically set this configuration parameter to something like 'modbus0'.
de: Der Parameter "Modbus-ID" erstellt den Link zu einem Modbus-Service über seine OpenEMS Component-ID. Zur Laufzeit wird der Benutzer diesen Konfigurationsparameter typischerweise auf so etwas wie ' modbus0 ' setzen.

source: The Modbus service implementation requires us to provide the Modbus _Unit-ID_ (also commonly called _Device-ID_ or _Slave-ID_) of the Modbus slave device. This is the ID that is configured at the simulated meter.
de: Die Modbus-Service-Implementierung verlangt von uns, dass wir die Modbus _ Unit-ID _ (auch _ Device-ID _ oder _ Slave-ID _) des Modbus-Slave-Geräts zur Verfügung stellen. Dies ist die ID, die am simulierten Meter konfiguriert ist.

source: The *Modbus_target* will be automatically set by OpenEMS framework and does usually not need to be configured by the user. _Note_: Linking other OpenEMS Components is implemented using OSGi References. The OpenEMS Edge framework therefor sets the 'target' property of a reference to filter the matched services.
de: Das * Modbus _ target * wird automatisch durch OpenEMS-Framework gesetzt und muss in der Regel nicht vom Benutzer konfiguriert werden. _ Note _: Die Verknüpfung anderer OpenEMS-Komponenten wird mit OSGi-Referenzen implementiert. Das OpenEMS Edge-Framework legt damit die "Zieleigenschaft" eines Referenzbezugs fest, um die passenden Dienste zu filtern.

source: The *webconsole_configurationFactory_nameHint* parameter sets a custom name for Apache Felix Web Console, helping the user to find the correct bundle.
de: Der Parameter * webconsole _ configurationFactory _ nameHint * legt einen eigenen Namen für Apache Felix Web Console fest, der dem Benutzer hilft, das richtige Paket zu finden.

source: Implement the OpenEMS Component
de: Die OpenEMS-Komponente umsetzen

source: The Bndtools assistant created a `ProviderImpl.java` file. First step is to set a proper name for this file. To rename the file, select it by clicking on it and choose btn:[Refactor] -> btn:[Rename...] in the menu. Write `MeterSimulated` as 'New name' and press btn:[Finish].
de: Der Bndtools-Assistent hat eine ' ProviderImpl.java '-Datei erstellt. Der erste Schritt ist, einen richtigen Namen für diese Datei festzulegen. Um die Datei umzubenennen, wählen Sie sie aus, indem Sie darauf klicken und btn: [Refactor]-> btn: [Umbenennen ...] im Menü. Schreiben Sie ' MeterSimulated ' als ' Neuer Name ' und drücken Sie btn: [Finish].

source: Renaming a Java class in Eclipse IDE
de: Umbenennung einer Java-Klasse in Eclipse IDE

source: Afterwards replace the content of `MeterSimulated.java` file with the following code:
de: Danach ersetzen Sie den Inhalt der ' MeterSimulated.java '-Datei durch folgenden Code:

source: import org.osgi.service.cm.ConfigurationAdmin; import org.osgi.service.component.ComponentContext; import org.osgi.service.component.annotations.Activate; import org.osgi.service.component.annotations.Component; import org.osgi.service.component.annotations.ConfigurationPolicy; import org.osgi.service.component.annotations.Deactivate; import org.osgi.service.component.annotations.Reference; import org.osgi.service.component.annotations.ReferenceCardinality; import org.osgi.service.component.annotations.ReferencePolicy; import org.osgi.service.component.annotations.ReferencePolicyOption; import org.osgi.service.metatype.annotations.Designate;
de: org.osgi.service.cm.ConfigurationAdmin importieren; org.osgi.service.component.ComponentContext importieren; org.osgi.service.component.annotations.Activate importieren; org.osgi.service.component.annotations.Component importieren; org.osgi.service.component.annotations.ConfigurationPolicy importieren; org.osgi.service.component.annotations.Deactivate importieren; org.osgi.service.component.annotations.Reference importieren; org.osgi.service.component.annotations.ReferenceCardinality importieren; org.osgi.service.component.annotations.ReferencePolicy importieren; org.osgi.service.component.annotations.ReferencePolicyOption importieren; org.osgi.service.metatype.annotations.Designate importieren;

source: import io.openems.edge.bridge.modbus.api.AbstractOpenemsModbusComponent; import io.openems.edge.bridge.modbus.api.BridgeModbus; import io.openems.edge.bridge.modbus.api.ModbusProtocol; import io.openems.edge.bridge.modbus.api.element.SignedWordElement; import io.openems.edge.bridge.modbus.api.task.FC3ReadRegistersTask; import io.openems.edge.common.channel.doc.Doc; import io.openems.edge.common.component.OpenemsComponent; import io.openems.edge.common.taskmanager.Priority; import io.openems.edge.meter.api.MeterType; import io.openems.edge.meter.api.SymmetricMeter;
de: io.openems.edge.bridge.modbus.api.AbstractOpenemsModbusComponent importieren; io.openems.edge.bridge.modbus.api.BridgeModbus importieren; io.openems.edge.bridge.modbus.api.ModbusProtocol importieren; io.openems.edge.bridge.modbus.api.element.SignedWordElement importieren; io.openems.edge.bridge.modbus.api.task.FC3ReadRegistersTask importieren; io.openems.edge.common.channel.doc.Doc importieren; io.openems.edge.common.component.OpenemsComponent importieren; io.openems.edge.common.taskmanager.Priority importieren; io.openems.edge.meter.api.MeterType importieren; io.openems.edge.meter.api.SymmetricMeter importieren;

source: @Designate(ocd = Config.class, factory = true) // <1> @Component( // <2> name = "Meter.Simulated", // <3> immediate = true, // <4> configurationPolicy = ConfigurationPolicy.REQUIRE) // <5> public class MeterSimulated extends AbstractOpenemsModbusComponent // <6> implements SymmetricMeter, OpenemsComponent { // <7>
de: @Designate (ocd = Config.class, factory = true)//<1> @Component (/<2> Name = "Meter.Simulated",/<3> Sofort = true,//<4> KonfigurationPolicy = ConfigurationPolicy.REQUIRE)//<5> Öffentliche Klasse MeterSimulated erweitert AbstractOpenemsModbusComponent//<6> Implementiert SymmetricMeter, OpenemsComponent {//<7>

source: @Reference protected ConfigurationAdmin cm; // <8>
de: @Reference Schutze <8>

source: @Reference(policy = ReferencePolicy.STATIC, policyOption = ReferencePolicyOption.GREEDY, cardinality = ReferenceCardinality.MANDATORY) protected void setModbus(BridgeModbus modbus) { super.setModbus(modbus); // <10> }
de: @Reference (policy = ReferencePolicy.STATIC, policyoption = ReferencePolicyOption.GREEDY, cardinality = ReferenceCardinality.MANDATORY) Geschützt ist levot Modbus (BridgeModbus modbus) { super.setModbus (modbus); <10> }

source: @Activate void activate(ComponentContext context, Config config) { // <11> this.meterType = config.type();
de: @Activate Leere Aktivierung (ComponentContext-Kontext, Config config) {//<11> This.meterType = config.type ();

source: @Deactivate protected void deactivate() { // <12> super.deactivate(); }
de: @Deactivate Geschützte Leere deaktivieren () {//<12> Super.deaktivieren (); }

source: public enum ChannelId implements io.openems.edge.common.channel.doc.ChannelId { // <13> ; private final Doc doc;
de: Public enum ChannelId implementiert io.openems.edge.common.channel.doc.ChannelId {//<13> ; Privates Finale Doc;

source: private ChannelId(Doc doc) { this.doc = doc; }
de: Privat-Kanäle (Doc doc) { This.doc = doc; }

source: public Doc doc() { return this.doc; } }
de: public doc doc () { Zurück this.doc; } }

source: @Override public MeterType getMeterType() { // <14> return this.meterType; }
de: @Override public MeterType getMeterType () {//<14> Rückseite this.meterType; }

source: @Override protected ModbusProtocol defineModbusProtocol() throws OpenemsException { // <15> return new ModbusProtocol(this, // <16> new FC3ReadRegistersTask(1000, Priority.HIGH, // <17> m(SymmetricMeter.ChannelId.ACTIVE_POWER, new SignedWordElement(1000)))); // <18> }
de: @Override Das <15> Neues ModbusProtocol (this,//<16> Neue FC3ReadRegistersTask-1000, Priority.HIGH,//<17> m (SymmetricMeter.ChannelId.ACTIVE _ POWER, new SignedWordElement-1000)))); <18> }

source: The *@Designate* annotation is used for OSGi to create a connection to the _Config_ annotation class. It also defines this Component as a _factory_, i.e. it can produce multiple instances with different configurations.
de: Die * @Designate *-Anmerkung wird für OSGi verwendet, um eine Verbindung zur _ Config _ Anmerkunde-Klasse zu erstellen. Es definiert diese Komponente auch als _ factory _, d.h. es kann mehrere Instanzen mit unterschiedlichen Konfigurationen erzeugen.

source: The *@Component* annotation marks this class as an OSGi component.
de: Die * @Component *-Anmerkung markiert diese Klasse als OSGi-Komponente.

source: The *name* property sets the unique name of this component. It is used to store configuration in the filesystem, to identify the component inside Apache Felix Web Console, and so on. Configure a human-readable name in the form *[nature].[vendor].[product]*.
de: Die * name * Eigenschaft setzt den eindeutigen Namen dieser Komponente. Es wird verwendet, um die Konfiguration im Dateisystem zu speichern, um die Komponente innerhalb der Apache Felix Web-Konsole zu identifizieren und so weiter. Konfigurieren Sie einen menschlich lesbaren Namen in der Form * [Natur]. [Verkäufer]. [product] *.

source: The *immediate* property defines whether the component should be started immediately. Configure the Component to be started immediately after configuration, i.e. it is not waiting till its service is required by another Component.
de: Die * immediate *-Eigenschaft legt fest, ob die Komponente sofort gestartet werden soll. Konfigurieren Sie die Komponente, die unmittelbar nach der Konfiguration gestartet werden soll, d.h. sie wartet nicht, bis ihr Service von einem anderen Bauteil benötigt wird.

source: The *configurationPolicy* define that the configuration of the Component is required before it gets activated.
de: Die * Konfigurationspolitik * definiert, dass die Konfiguration der Komponente erforderlich ist, bevor sie aktiviert wird.

source: To ease the implementation of a Modbus device we can extend the *AbstractOpenemsModbusComponent* class.
de: Um die Implementierung eines Modbus-Geräts zu erleichtern, können wir die * AbstractOpenemsModbusComponent *-Klasse erweitern.

source: If the device was using another protocol, it is advisable to use the *AbstractOpenemsComponent* class as a convenience layer instead of implementing everything required by the *OpenemsComponent* interface manually.
de: Wenn das Gerät ein anderes Protokoll benutzte, ist es ratsam, die * AbstractOpenemsComponent *-Klasse als Komfortschicht zu verwenden, anstatt alles, was von der * OpenemsComponent *-Schnittstelle benötigt wird, manuell zu implementieren.

source: The class implements *OpenemsComponent*. This makes it an xref:coreconcepts.adoc#_openems_component[OpenEMS Component]. The Device that we are is a *SymmetricMeter*. We already defined the required Channels in the _initializeChannels()_ method. Additionally the Component also needs to implement the Nature interface.
de: Die Klasse implementiert * OpenemsComponent *. Das macht es zu einem xref: coreconcepts.adoc # _ openems _ component [OpenEMS Component]. Das Gerät, das wir sind, ist ein * SymmetricMeter *. Wir haben bereits die benötigten Kanäle in der _ initializeChannels () _ Methode definiert. Zusätzlich muss die Komponente auch die Natur-Schnittstelle implementieren.
