Repository: OpenEMS/openems
Catalog: doc/modules/ROOT/pages/i18n/*.po
Languages: de

source: Eclipse IDE showing 'no problems'
de: Eclipse IDE zeigt "keine Probleme"

source: Run OpenEMS Edge and start Simulator
de: Führen Sie OpenEMS Edge und starten Sie den Simulator

source: Run OpenEMS Edge
de: OpenEMS Edge

source: In Eclipse IDE open the project btn:[io.openems.edge.application] and double click on btn:[EdgeApp.run].
de: In Eclipse IDE öffnen Sie das Projekt btn: [io.openems.edge.application] und doppelklicken Sie auf btn: [EdgeApp.run].

source: io.openems.edge.application project in Eclipse IDE
de: io.openems.edge.application Projekt in Eclipse IDE

source: Click on btn:[Run OSGi] to run OpenEMS Edge. You should see log outputs on the console inside Eclipse IDE.
de: Klicken Sie auf btn: [Run OSGi], um OpenEMS Edge zu starten. Sie sollten die Log-Ausgänge auf der Konsole in Eclipse IDE sehen.

source: OpenEMS Edge initial log output
de: OpenEMS Edge erste Protokollausgabe

source: Configure and start the Simulator
de: Konfiguration und Start des Simulators

source: Open the http://localhost:8080/system/console/configMgr[Apache Felix Web Console Configuration icon:external-link[]].
de: Öffnen Sie das http://localhost:8080/system/console/configMgr[Apache Felix Web Console Configuration icon:external-link[]].

source: Login with username *admin* and password *admin*.
de: Melden Sie sich mit Benutzername * Admin * und Passwort * admin * an.

source: Note: *Apache Felix Web Console Configuration* only works with a running console, otherwise you will receive a *error message* on your Browser.
de: Hinweis: * Apache Felix Web Console Configuration * funktioniert nur mit einer laufenden Konsole, sonst erhalten Sie eine * Fehlermeldung * auf Ihrem Browser.

source: Configure a Scheduler
de: Einen Scheduler konfigurieren

source: The Scheduler is responsible for executing the control algorithms (Controllers) and defines the OpenEMS Edge application cycle
de: Der Scheduler ist für die Ausführung der Steuerungsalgorithmen (Controller) verantwortlich und definiert den OpenEMS Edge Anwendungszyklus

source: ... Click on "Scheduler All Alphabetically"
de: ... Klicken Sie auf "Scheduler Alles Alphabetisch"

source: Configuration of All Alphabetically Scheduler
de: Konfiguration aller Alphabetisch-Planer

source: ... Accept the default values and click btn:[Save]
de: ... Akzeptieren Sie die Standardwerte und klicken Sie auf btn: [Speichern]

source: ... You created your first instance of an OpenEMS Component with ID "scheduler0". The log shows:
de: ... Sie haben Ihre erste Instanz eines OpenEMS-Komponenten mit ID "scheduler0" erstellt. Das Protokoll zeigt:

source: `INFO [onent.AbstractOpenemsComponent] [scheduler0] Activate AllAlphabetically [edge.scheduler.allalphabetically]`
de: ' INFO [Komponente. AbstractOpenemsComponent [scheduler0] Aktivieren AllAlphabetically [edge.scheduler.allalphabetically] '

source: Add any other OpenEMS Components in the same way:
de: Fügen Sie alle anderen OpenEMS-Komponenten auf die gleiche Weise hinzu:

source: Configure debug outputs on the console: "Controller Debug Log". The default values can be accepted without changes.
de: Konfigurieren Sie Debug-Ausgänge auf der Konsole: "Controller Debug Log". Die Standardwerte können ohne Änderungen akzeptiert werden.

source: Configuration of Controller Debug Log
de: Konfiguration des Controllers Debug Log

source: The log shows:
de: Das Protokoll zeigt:

source: `INFO [onent.AbstractOpenemsComponent] [ctrlDebugLog0] Activate DebugLog [edge.controller.debuglog]`,
de: ' INFO [Komponente. AbstractOpenemsComponent] [ctrlDebugLog0] Activate DebugLog [edge.controller.debuglog] ',

source: followed once per second by
de: Einmal pro Sekunde gefolgt

source: `INFO [e.controller.debuglog.DebugLog] [ctrlDebugLog0] _sum[Ess SoC:0 %|L:0 W Grid L:0 W Production L:0 W Consumption L:0 W]`.
de: ' INFO [e.controller.debuglog.DebugLog] [ctrlDebugLog0] _ sum [Ess SoC:0% | L:0 W Grid L:0 W Production L:0 W-Verbrauch L:0 W] '.

source: It is once per second because you accepted the default value of "1000 ms" for "Cycle time" in the Scheduler configuration.
de: Es ist einmal pro Sekunde, weil Sie den Standardwert von "1000 ms" für "Zykluszeit" in der Scheduler-Konfiguration akzeptiert haben.

source: Configure the standard-load-profile datasource using the according input file in the csv-reader: "Simulator DataSource: CSVReader". The default values can be accepted without changes. The "Source" value is already set to the right input file.
de: Konfigurieren Sie die Standard-Load-Profil-Datasource mit der entsprechenden Eingabedatei im csv-Reader: "Simulator DataSource: CSVReader". Die Standardwerte können ohne Änderungen akzeptiert werden. Der "Source"-Wert ist bereits auf die richtige Eingabedatei eingestellt.

source: Configuration of Simulator DataSource: CSVReader as standard load profile datasource
de: Konfiguration von Simulator DataSource: CSVReader als Standard-Lastprofil Datenquelle

source: `INFO [onent.AbstractOpenemsComponent] [datasource0] Activate CSVDatasource [edge.simulator.datasource.csv]`,
de: ' INFO [Komponente. AbstractOpenemsComponent [datasource0] Aktivieren Sie CSVDatasource [edge.simulator.datasource.csv] ',

source: The data source was configured with the OpenEMS Component ID "datasource0" which will be used in the next step as reference.
de: Die Datenquelle wurde mit der OpenEMS Component ID "datasource0" konfiguriert, die im nächsten Schritt als Referenz verwendet wird.

source: Configure a simulated grid meter: "Simulator GridMeter Acting". Configure the Datasource-ID "datasource0" to refer to the data source configured above.
de: Konfigurieren Sie einen simulierten Gittermesser: "Simulator GridMeter Acting". Konfigurieren Sie die Datasource-ID "datasource0", um auf die oben konfigurierte Datenquelle zu verweisen.

source: Configuration of Simulator GridMeter Acting
de: Konfiguration von Simulator-GridMeter-Acting

source: This time some more logs will show up. Most importantly they show, that the Grid meter now shows a power value.
de: Dieses Mal werden noch einige Protokolle erscheinen. Am wichtigsten ist, dass sie zeigen, dass der Grid-Zähler nun einen Stromwert zeigt.

source: INFO [onent.AbstractOpenemsComponent] [meter0] Activate GridMeter [edge.simulator.meter.grid.acting] [onent.AbstractOpenemsComponent] [meter0] Deactivate GridMeter [edge.simulator.meter.grid.acting] [onent.AbstractOpenemsComponent] [meter0] Activate GridMeter [edge.simulator.meter.grid.acting] [e.controller.debuglog.DebugLog] [ctrlDebugLog0] _sum[Ess SoC:0 %|L:0 W Grid L:1423 W Production L:0 W Consumption L:1423 W] meter0[1423 W]
de: INFO [Komponente. AbstractOpenemsComponent [meter0] Aktivieren GridMeter [edge.simulator.meter.grid.acting] [Komponente. AbstractOpenemsComponent] [meter0] Deaktivieren GridMeter [edge.simulator.meter.grid.acting] [Komponente. AbstractOpenemsComponent [meter0] Aktivieren GridMeter [edge.simulator.meter.grid.acting] [e.controller.debuglog.DebugLog] [ctrlDebugLog0] _ sum [Ess SoC:0% | L:0 W Grid L:1423 W Production L:0 W Verbrauch L:1423 W] meter0[1423 W]

source: This setup causes the simulated grid-meter to take the standardized load-profiles data as input parameter.
de: Diese Einstellung führt dazu, dass der simulierte Gittermesser die standardisierten Belastungsprofile als Eingangsparameter nimmt.

source: 'Acting' referrs to the fact, that this meter actively provides data - in opposite to a 'Reacting' device that is reacting on other components: for example the 'Simulator.EssSymmetric.Reacting' configured below.
de: "Acting" verweist darauf, dass dieser Zähler aktiv Daten zur Verfügung stellt-im Gegensatz zu einem "Reacting"-Gerät, das auf andere Komponenten reagiert: Zum Beispiel die "Simulator.EssSymmetric.Reacting", die unten konfiguriert ist.

source: Configure a simulated reacting energy storage system: "Simulator EssSymmetric Reacting". The default values can be accepted without changes. (If you choose an other setup as the one described here you may have to create a new Datasource-Component and provide its ID here. The actual data is ignored, but the Datasource's Time-Delta value is required to calculate values with time-dependant units.)
de: Konfigurieren Sie ein simuliertes Reaktionssystem: "Simulator EssSymmetrische Reaktion". Die Standardwerte können ohne Änderungen akzeptiert werden. (Wenn Sie ein anderes Setup wählen, wie es hier beschrieben wird, müssen Sie unter Umständen eine neue Datenbankkomponente erstellen und hier ihre ID angeben. Die tatsächlichen Daten werden ignoriert, aber der Time-Delta-Wert des Datasource ist erforderlich, um Werte mit zeitabhängigen Einheiten zu berechnen.)

source: Configuration of Simulator EssSymmetric Reacting
de: Konfiguration des Simulators EssSymmetric reagiert

source: `INFO [e.controller.debuglog.DebugLog] [ctrlDebugLog0] _sum[Ess SoC:50 %|L:0 W Grid L:864 W Production L:0 W Consumption L:864 W] ess0[SoC:50 %|L:0 W|OnGrid] meter0[864 W]`
de: ' INFO [e.controller.debuglog.DebugLog] [ctrlDebugLog0] _ sum [Ess SoC:50% | L:0 W Grid L:864 W Production L:0 W Verbrauch L:864 W] ess0[SoC:50% | L:0 W | OnGrid] meter0[864 W] '

source: Note, that the DebugLog now shows data for the battery, but the charge/discharge power stays at "0 W" and the state of charge stays at "50 %" as configured. Next step is to configure a control algorithm that tells the battery to charge or discharge.
de: Beachten Sie, dass das DebugLog nun Daten für die Batterie anzeigt, aber die Lade-/Entladeleistung bei "0 W" bleibt und der Ladezustand bei "50%" bleibt, wie konfiguriert. Der nächste Schritt ist, einen Steueralgorithmus zu konfigurieren, der der Batterie sagt, dass sie aufladen oder entladen soll.

source: Configure the self-consumption optimization algorithm: "Controller Balancing Symmetric". Configure the Ess-ID "ess0" and Grid-Meter-ID "meter0" to refer to the components configured above.
de: Konfigurieren Sie den Algorithmus zur Selbstverbrauchsoptimierung: "Controller Balancing Symmetric". Konfigurieren Sie die Ess-ID "ess0" und die Grid-Meter-ID "meter0", um auf die oben konfigurierten Komponenten zu verweisen.

source: Configuration of Symmetric Balancing Controller
de: Konfiguration von symmetrischem Balancing Controller

source: Note, how the Controller now tells the battery to discharge (`Ess SoC:49 %|L:1167 W`), trying to balance the Grid power to "0 W" (`Grid L:-39 W`):
de: Beachten Sie, wie der Controller nun dem Akku sagt, dass er entladen soll (' Ess SoC:49% | L:49 W ') und versucht, die Grid-Power auf "0 W" (' Grid L:-39 W ') auszugleichen:

source: Configure the websocket Api Controller: "Controller Api Websocket". The default values can be accepted without changes.
de: Konfigurieren Sie den Websocket Api Controller: "Controller Api Websocket". Die Standardwerte können ohne Änderungen akzeptiert werden.

source: Configuration of Controller Api Websocket
de: Konfiguration des Controllers Api Websocket

source: INFO [onent.AbstractOpenemsComponent] [ctrlApiWebsocket0] Activate WebsocketApi [edge.controller.api.websocket] INFO [ler.api.websocket.WebsocketApi] [ctrlApiWebsocket0] Websocket-Api started on port [8085].
de: INFO [Komponente. AbstractOpenemsComponent] [ctrlApiWebsocket0] Aktivieren WebsocketApi [edge.controller.api.websocket] INFO [ler.api.websocket.WebsocketApi] [ctrlApiWebsocket0] Websocket-Api startete auf Port [8085].

source: The Controller Api Websocket is required to enable access to OpenEMS Edge by a local OpenEMS UI.
de: Der Controller Api Websocket ist erforderlich, um den Zugriff auf OpenEMS Edge durch eine lokale OpenEMS-UI zu ermöglichen.

source: Setup Visual Studio Code for OpenEMS UI
de: Setup Visual Studio Code für OpenEMS UI

source: Download https://nodejs.org[node.js LTS icon:external-link[]] and install it.
de: Download https:/nodejs.org[node.js LTS icon:external-link[]] und installieren Sie es.

source: Download https://code.visualstudio.com/[Visual Studio Code icon:external-link[]], install and start it.
de: Laden Sie https://code.visualstudio.com/[Visual Studio Code icon:external-link[]], installieren Sie es und starten Sie es.

source: Open OpenEMS UI source code in Visual Studio Code:
de: Öffnen Sie OpenEMS UI Quellcode in Visual Studio Code:

source: Menu: btn:[File] → btn:[Open Folder...] → Select the `ui` directory inside the downloaded source code (for example `C:\Users\your.user\git\openems\ui`) → btn:[Select directory]
de: Menü: btn: [Datei] → btn: [Offener Ordner ...] → Wählen Sie das ' ui '-Verzeichnis innerhalb des heruntergeladenen Quellcodes (zum Beispiel ' C:\Users\your.user\git\openems\ui ') → btn: [Verzeichnis auswählen]

source: Open the integrated terminal:
de: Offenes Energiemanagementsystem

source: Menu: btn:[Terminal] → btn:[New Terminal]
de: Menü: btn: [Terminal] → btn: [Neues Terminal]

source: If you receive an error message that the command `npm` could not be found, make sure that node.js is installed and restart Visual Studio Code.
de: Wenn Sie eine Fehlermeldung erhalten, dass der Befehl ' npm ' nicht gefunden werden konnte, stellen Sie sicher, dass node.js installiert ist und starten Sie den Visual Studio Code neu.

source: Resolve and download dependencies:
de: Abhängigkeiten lösen und herunterladen:

source: Run OpenEMS UI
de: **OpenEMS UI** ist die generische Benutzeroberfläche

source: In Visual Studios integrated terminal type...
de: In Visual Studios integrierter Terminaltyp ...

source: `NG Live Development Server is listening on localhost:4200, open your browser on http://localhost:4200/`
de: ' NG Live Development Server ist das Hören auf localhost:4200, öffnen Sie Ihren Browser auf http://localhost:4200/'

source: Open a browser at http://localhost:4200
de: Öffnen Sie einen Browser bei http://localhost:4200

source: You should see OpenEMS UI. Log in as user "guest" by clicking on the tick mark. Alternatively type "admin" in the password field to log in with extended permissions.
de: Sie sollten OpenEMS UI sehen. Melden Sie sich als Benutzer "Gast" an, indem Sie auf das Häkchen klicken. Alternativ tippen Sie "Admin" in das Passwortfeld, um sich mit erweiterten Berechtigungen einzuloggen.

source: OpenEMS UI Login screen
de: OpenEMS UI Screenshots

source: Change to the Energymonitor by clicking on the arrow.
de: Wechseln Sie auf den Energymonitor, indem Sie auf den Pfeil klicken.

source: OpenEMS UI Overview screen
de: **OpenEMS UI** ist die generische Benutzeroberfläche

source: You should see the Energymonitor showing the same data as the DebugLog output on the console.
de: Sie sollten den Energymonitor sehen, der die gleichen Daten wie die DebugLog-Ausgabe auf der Konsole zeigt.

source: OpenEMS UI Energymonitor screen
de: **OpenEMS UI** ist die generische Benutzeroberfläche

source: OpenEMS UI will complain that "no timedata source is available". Because of this the historic chart is not yet functional.
de: OpenEMS UI wird sich darüber beschweren, dass "keine timedata-Quelle verfügbar ist". Aus diesem Grund ist die historische Grafik noch nicht funktionsfähig.

source: Integrate OpenEMS Backend
de: OpenEMS-Backend integrieren

source: Instead of having Edge and UI talk to each other directly, the communication can also be proxied via Backend.
de: Anstatt Edge und UI direkt miteinander sprechen zu lassen, kann die Kommunikation auch über Backend proxiert werden.

source: Run and configure OpenEMS Backend
de: OpenEMS Backend starten und konfigurieren

source: In Eclipse IDE open the project btn:[io.openems.backend.application] and double click on btn:[BackendApp.bndrun].
de: In Eclipse IDE öffnen Sie das Projekt btn: [io.openems.backend.application] und doppelklicken Sie auf btn: [BackendApp.bndrun].

source: io.openems.backend.application project in Eclipse IDE
de: io.openems.backend.application Projekt in Eclipse IDE

source: Click on btn:[Run OSGi] to run OpenEMS Backend. You should see log outputs on the console inside Eclipse IDE.
de: Klicken Sie auf btn: [Run OSGi], um OpenEMS Backend zu starten. Sie sollten die Log-Ausgänge auf der Konsole in Eclipse IDE sehen.

source: OpenEMS Backend initial log output
de: OpenEMS Backend erste Log-Ausgabe

source: Configure the Backend
de: Den Backend konfigurieren

source: Open the http://localhost:8079/system/console/configMgr[Apache Felix Web Console Configuration icon:external-link[]].
de: Öffnen Sie das http://localhost:8079/system/console/configMgr[Apache Felix Web Console Configuration icon:external-link[]].

source: Apache Felix Web Console for OpenEMS Backend is started on port 8079 by default. This is configured using the `org.osgi.service.http.port` setting in BackendApp.bndrun.
de: Die Apache Felix Web-Konsole für OpenEMS-Backend wird standardmäßig auf Port 8079 gestartet. Dies wird mit der ' org.osgi.service.http.port '-Einstellung in BackendApp.bndrun konfiguriert.

source: Apache Felix Web Console Configuration for OpenEMS Backend
de: Apache Felix Web-Konsolen-Konfiguration für OpenEMS-Backend

source: Configure Edge.Websocket
de: Edge.Websocket konfigurieren

source: The *Edge.Websocket* service is responsible for the communication between OpenEMS Backend and OpenEMS Edge.
de: Der * Edge.Websocket *-Service ist für die Kommunikation zwischen OpenEMS Backend und OpenEMS Edge verantwortlich.

source: In the example we are configuring the Port 8081. This port needs to match with what we configure later in OpenEMS Edge.
de: In dem Beispiel konfigurieren wir den Port 8081. Dieser Port muss mit dem übereinstimmen, was wir später in OpenEMS Edge konfigurieren.

source: Configuration of Backend Edge.Websocket
de: Konfiguration von Backend Edge.Websocket

source: Configure Ui.Websocket
de: Ui.Websocket konfigurieren

source: The *Ui.Websocket* service is responsible for the communication between OpenEMS Backend and OpenEMS UI.
de: Der * Ui.Websocket *-Service ist für die Kommunikation zwischen OpenEMS Backend und OpenEMS UI verantwortlich.

source: In the example we are configuring the Port 8082. This port needs to match with what we configure later in the OpenEMS UI environment file.
de: In dem Beispiel konfigurieren wir den Port 8082. Dieser Port muss mit dem übereinstimmen, was wir später in der OpenEMS-UI-Umgebungsdatei konfigurieren.

source: Configuration of Backend Ui.Websocket
de: Konfiguration von Backend Ui.Websocket

source: Configure Timedata
de: Timedata konfigurieren

source: The *Timedata* service provider is responsible for holding the current and historic data of each connected Edge device.
de: Der * Timedata *-Dienstleister ist für die Speicherung der aktuellen und historischen Daten jedes angeschlossenen Edge-Gerätes verantwortlich.

source: In the example we are configuring the *Timedata.Dummy* service. It takes no configuration parameters, so just press btn:[Save]. In a production system you would want to use a real implementation like *Timedata.InfluxDB*.
de: Im Beispiel konfigurieren wir den * Timedata.Dummy * Service. Es braucht keine Konfigurationsparameter, also drücken Sie einfach btn: [Speichern]. In einem Produktionssystem möchten Sie eine echte Implementierung wie * Timedata.InfluxDB * verwenden.

source: Configuration of Backend Timedata.Dummy
de: Konfiguration Backend Timedata.Dummy

source: Configure Metadata
de: Metadaten konfigurieren

source: The *Metadata* service provider is responsible for authentication of Edge devices and Users connecting via UI.
de: Der * Metadata *-Dienstleister ist für die Authentifizierung von Edge-Geräten und Nutzern verantwortlich, die über UI verbunden sind.

source: In the example we are configuring the *Metadata.Dummy* service. It takes no configuration parameters, so just press btn:[Save]. In a production system you would want to use a real implementation like *Metadata.File* or *Metadata.Odoo*.
de: Im Beispiel konfigurieren wir den * Metadata.Dummy *-Dienst. Es braucht keine Konfigurationsparameter, also drücken Sie einfach btn: [Speichern]. In einem Produktionssystem möchten Sie eine echte Implementierung wie * Metadata.File * oder * Metadata.Odoo * verwenden.

source: Configuration of Backend Metadata.Dummy
de: Konfiguration von Backend Metadata.Dummy

source: Configure OpenEMS Edge
de: OpenEMS Edge

source: Next we will configure OpenEMS Edge to connect to the OpenEMS Backend `Edge.Websocket` service.
de: Als nächstes werden wir OpenEMS Edge konfigurieren, um uns mit dem OpenEMS-Backend ' Edge.Websocket ' zu verbinden.

source: Switch back to the http://localhost:8080/system/console/configMgr[Apache Felix Web Console Configuration for OpenEMS Edge icon:external-link[]].
de: Wechseln Sie zurück zum http://localhost:8080/system/console/configMgr[Apache Felix Web Console Configuration für OpenEMS Edge icon:external-link[]].

source: Configure the "Controller Api Backend" Component. The default values can be accepted without changes right now.
de: Konfigurieren Sie die Komponente "Controller Api Backend". Die Standardwerte können jetzt ohne Änderungen akzeptiert werden.

source: Configuration of Controller Api Backend
de: Konfiguration von Controller Api Backend

source: Some configuration parameters are still noteworthy here:
de: Einige Konfigurationsparameter sind hier noch bemerkenswert:

source: "Apikey" is used to authenticate this Edge at the Backend Metadata service.
de: "Apikey" wird verwendet, um diesen Edge im Backend Metadata-Dienst zu authentifizieren.

source: "Uri" is set to `ws://localhost:8081`. This defines an unencrypted websocket ("ws://") connection to the local computer on port "8081" like we configured before for the Edge.Websocket.
de: "Uri" ist auf ' ws://localhost:8081 ' gesetzt. Damit wird eine unverschlüsselte Websocket ("ws://")-Verbindung zum lokalen Computer auf Port "8081" definiert, wie wir sie zuvor für den Edge.Websocket konfiguriert haben.

source: "Cycle Time" defines how often data is sent to Backend
de: "Cycle Time" legt fest, wie oft Daten an Backend gesendet werden

source: Once you press btn:[save] you should see logs in OpenEMS Backend
de: Sobald Sie btn gedrückt haben: [Speichern], sollten Sie Protokolle in OpenEMS Backend sehen

source: and OpenEMS Edge
de: **OpenEMS Edge** läuft vor Ort und steuert die lokalen Geräte

source: Connect OpenEMS UI with Backend
de: **OpenEMS UI** ist die generische Benutzeroberfläche

source: In Visual Studio Code open the file `ui/src/environments/environment.ts` and configure it as follows:
de: In Visual Studio Code öffnen Sie die Datei ' ui/src/environmentess.ts ' und konfigurieren Sie sie wie folgt:

source: import { Environment } from "../app/shared/type/environment";
de: Importieren {Environment} aus ".. /app/shared/type/environment ";

source: export const environment: Environment = { production: false, debugMode: true, url: "ws://localhost:8082", backend: "OpenEMS Backend", };
de: Export-Konst-Umgebung: Umwelt = { Produktion: Falsch, DebugMode: Stimmt, URL: "ws://localhost:8082", Backend: "OpenEMS Backend", };

source: It is again noteworthy here, that:
de: Bemerkenswert ist hier wieder:

source: "url" is set to `ws://localhost:8082`. This defines an unencrypted websocket ("ws://") connection to the local computer on port "8082" like we configured before for the Ui.Websocket.
de: "URL" ist auf ' ws://localhost:8082 ' gesetzt. Dies definiert eine unverschlüsselte Websocket ("ws://") Verbindung zum lokalen Computer auf dem Port "8082", wie wir sie zuvor für den Ui.Websocket konfiguriert haben.

source: "backend" is set to "OpenEMS Backend". This option is used in certain places inside OpenEMS UI that need to be treated differently for connections to OpenEMS Edge and OpenEMS Backend.
de: "Backend" wird auf "OpenEMS Backend" gesetzt. Diese Option wird an bestimmten Stellen innerhalb von OpenEMS-UI verwendet, die für Verbindungen zu OpenEMS Edge und OpenEMS Backend unterschiedlich behandelt werden müssen.
