Repository: OpenEMS/openems
Catalog: doc/modules/ROOT/pages/i18n/*.po
Languages: de

source: In plain Java it is not required to add `implements OpenemsComponent` if we inherit from 'AbstractOpenemsComponent' or 'AbstractOpenemsModbusComponent'. Be aware that for OSGi dependency injection to function properly, it is still required to mention all implemented interfaces again, as it is not considering the complete inheritance tree.
de: In einem einfachen Java ist es nicht erforderlich, `implementiert OpenemsComponent` hinzuzufügen, wenn wir von 'AbstractOpenemsComponent' oder 'AbstractOpenemsModbusComponent' erben. Beachten Sie, dass es immer noch erforderlich ist, alle implementierten Schnittstellen erneut zu erwähnen, damit die Injizierung der OSGi-Abhängigkeiten richtig funktionieren kann, da sie nicht die komplette Vererbungshierarchie berücksichtigt.

source: The `super.activate()` method requires an instance of *ConfigurationAdmin* as a parameter. Using the *@Reference* annotation the OSGi framework is going to provide the ConfigurationAdmin service via dependency injection.
de: Die `super.activate()`-Methode benötigt eine Instanz von *ConfigurationAdmin* als Parameter. Mit der *@Reference* Annotation wird das OSGi-Framework den ConfigurationAdmin-Service injizieren.

source: We call the constructor of the super class (`AbstractOpenemsModbusComponent`/`AbstractOpenemsComponent`) to initialize the Channels of the Component. It is important to list all ChannelId-Enums of all implemented Natures. The call takes the *ChannelId* declarations and creates a Channel instance for each of them; e.g. for the `SymmetricMeter.ACTIVE_POWER` ChannelId, an object instance of `IntegerReadChannel` is created that represents the Channel.
de: Wir rufen den Konstruktor der Super-Klasse (`AbstractOpenemsModbusComponent`/`AbstractOpenemsComponent`) auf, um die Channels der Komponente zu initialisieren. Es ist wichtig, alle ChannelId-Enums aller implementierten Natures aufzulisten. Der Aufruf nimmt die * ChannelId *-Deklarationen auf und erstellt für jede von ihnen eine Kanalinstanz; Zum Beispiel für den ' SymmetricMeter.ACTIVE _ POWER ' ChannelId wird eine Objektinstanz von `IntegerReadChannel` erstellt, die den Channel repräsentiert.

source: The Component utilizes an external Modbus Component (the _Modbus Bridge_) for the actual Modbus communication. We receive an instance of this service via dependency injection (like we did already for the _ConfigurationAdmin_ service). Most of the magic is handled by the _AbstractOpenemsModbusComponent_ implementation, but the way the OSGi framework works, we need to define the _@Reference_ explicitly here in the actual implementation of the component and call the parent `setModbus()` method.
de: Für die eigentliche Modbus-Kommunikation nutzt die Komponente eine externe Modbus-Komponente (die _ Modbus-Brücke _). Wir erhalten eine Instanz dieses Dienstes über die Abhängigkeitsspritze (wie wir es bereits für den _ConfigurationAdmin_ service getan haben). Der größte Teil der Magie wird durch die _AbstractOpenemsModbusComponent_ Implementation behandelt, aber die Art und Weise, wie das OSGi-Framework funktioniert, müssen wir hier in der eigentlichen Implementierung der Komponente explizit definieren und die Eltern-Methode `setModbus()` nennen.

source: The *activate()* method (marked by the *@Activate* annotation) is called on activation of an object instance of this Component. It comes with a ComponentContext and an instance of a configuration in the form of a Config object. All logic for activating and deactivating the OpenEMS Component is hidden in the super classes and just needs to be called from here.
de: Die *activate()*-Methode (gekennzeichnet durch die *@Activate* Annotation) wird zur Aktivierung einer Objektinstanz dieser Komponente aufgerufen. Es kommt mit einem ComponentContext und einer Instanz einer Konfiguration in Form eines Config-Objekts. Alle Logik für die Aktivierung und Deaktivierung der OpenEMS-Komponente ist in den Superklassen versteckt und muss nur von hier aus aufgerufen werden.

source: The *deactivate()* method (marked by the *@Deactivate* annotation) is called on deactivation of the Component instance.
de: Die *deactivate()* Methode (gekennzeichnet durch die *@Deactivate* Annotation) wird zur Deaktivierung der Komponenteninstanz aufgerufen.

source: The simulated implementation is only going to provide Channels defined by _OpenemsComponent_ and _SymmetricMeter_ natures. It is still good practice to add a skeleton for custom Channels to the Component implementation. We therefor add the _Channel Declaration_ block inside the class.
de: Die simulierte Implementierung wird nur Kanäle liefern, die von _ OpenemsComponent _ und _ SymmetricMeter _ natures definiert werden. Es ist immer noch eine gute Praxis, ein Skelett für kundenspezifische Kanäle zur Komponenten-Implementierung hinzuzufügen. Wir fügen daher die _ Channel Declaration _ block in die Klasse ein.

source: Channel declarations are *enum* types implementing the ChannelId interface.
de: Kanaldeklarationen sind * enum *-Typen, die die ChannelId-Schnittstelle implementieren.

source: This enum is empty, as we do not have custom Channels here.
de: Dieses Enum ist leer, da wir hier keine eigenen Kanäle haben.

source: ChannelId enums require a Doc object that provides meta information about the Channel - e.g. the above ACTIVE_POWER Channel is defined as `ACTIVE_POWER(new Doc().type(OpenemsType.INTEGER).unit(Unit.WATT)`
de: ChannelId enums benötigen ein Doc-Objekt, das Meta-Informationen über den Kanal liefert-z.B. der obige ACTIVE _ POWER Channel wird als ' ACTIVE _ POWER (new Doc () .type (OpenemsType.INTEGER) .unit (Unit.WATT) ' definiert.

source: The SymmetricMeter Nature requires us to provide a *MeterType* via a `MeterType getMeterType()` method. The MeterType is provided by the Config.
de: Die SymmetricMeter-Natur verlangt von uns, dass wir eine * MeterType * über eine ' MeterType getMeterType ()-Methode anbieten. Der MeterType wird vom Config zur Verfügung gestellt.

source: _AbstractOpenemsModbusComponent_ requires to implement a *defineModbusProtocol()* method that returns an instance of *ModbusProtocol*. The _ModbusProtocol_ class maps Modbus addresses to OpenEMS Channels and provides some conversion utilities. Instantiation of a _ModbusProtocol_ object uses the https://en.wikipedia.org/wiki/Builder_pattern#Java[Builder pattern icon:external-link[]]
de: _ AbstractOpenemsModbusComponent _ benötigt die Implementierung einer * defineModbusProtocol () *-Methode, die eine Instanz von * ModbusProtocol * zurückgibt. Die _ ModbusProtocol _ class maps Modbus Adressen zu OpenEMS-Kanälen und stellt einige Konvertierungsprogramme zur Verfügung. Die Instantiation of a _ ModbusProtocol _ object verwendet das https://en.wikipedia.org/wiki/Builder_pattern#Java [Builder pattern icon:external-link[]]

source: Creates a *new ModbusProtocol* instance. A reference to the component itself is the first parameter, followed by an arbitrary number of 'Tasks' (implemented as a Java varags array).
de: Erstellt eine * neue ModbusProtocol *-Instanz. Eine Referenz auf die Komponente selbst ist der erste Parameter, gefolgt von einer beliebigen Anzahl von ' Tasks ' (implementiert als Java-varags-Array).

source: *FC3ReadRegistersTask* is an implementation of Modbus http://www.simplymodbus.ca/FC03.htm[function code 3 "Read Holding Registers" icon:external-link[]]. Its first parameter is the start address of the register block. The second parameter is a priority information that defines how often this register block needs to be queried. Following parameters are an arbitrary number of *ModbusElements*.
de: * FC3ReadRegistersTask * ist eine Implementierung von Modbus http://www.simplymodbus.ca/FC03.htm[function Code 3 "Read Holding Registers" icon:external-link[]]. Sein erster Parameter ist die Startadresse des Registerblocks. Der zweite Parameter ist eine Prioritätsinformation, die festlegt, wie oft dieser Registerblock abgefragt werden muss. Folgende Parameter sind eine beliebige Anzahl von * ModbusElements *.

source: Most Modbus function codes are available by their respective _FC*_ implementation classes.
de: Die meisten Modbus-Funktionscodes sind von den jeweiligen _ FC * _ Implementierungsklassen verfügbar.

source: Here the internal *m()* method is used to make a simple 1-to-1 mapping between the Modbus element at address `1000` and the Channel _SymmetricMeter.ChannelId.ACTIVE_POWER_. The Modbus element is defined as a 16 bit word element with an signed integer value.
de: Hier wird die interne * m () *-Methode verwendet, um eine einfache 1-zu-1-Mapping zwischen dem Modbus-Element unter der Adresse ' 1000 ' und dem Channel _ SymmetricMeter.ChannelId.ACTIVE _ POWER _ zu erstellen. Das Modbus-Element wird als ein 16-Bit-Wort-Element mit einem signierten Integer-Wert definiert.

source: The _m()_ method also takes an instance of *ElementToChannelConverter* as an additional parameter. It can be used to add implicit unit conversions between Modbus element and OpenEMS Channel - like adding a scale factor that converts a read value of '95' to a channel value of '950'.
de: Die _ m () _-Methode nimmt auch eine Instanz von * ElementToChannelConverter * als zusätzlichen Parameter. Es kann verwendet werden, um implizite Einheiten-Konvertierungen zwischen Modbus-Element und OpenEMS-Kanal hinzuzufügen-wie zum Beispiel einen Skalenfaktor, der einen Lesewert von ' 95 ' in einen Kanalwert von ' 950 ' umwandelt.

source: For Modbus registers that are empty or should be ignored, the *DummyRegisterElement* can be used.
de: Für Modbus-Register, die leer sind oder ignoriert werden sollten, kann das * DummyRegisterElement * verwendet werden.

source: For more advanced channel-to-element mapping functionalities the internal *cm()* method can be used - e.g. to map one Modbus element to multiple Channels.
de: Für fortgeschrittene Kanal-zu-Element-Mapping-Funktionen kann die interne * cm () *-Methode verwendet werden-z.B. um ein Modbus-Element auf mehrere Kanäle zu kartieren.

source: Using this principle a complete Modbus table consisting of multiple register blocks that need to be read or written with different Modbus function codes can be defined. For details have a look at the existing implementation classes inside the Modbus Bridge source code.
de: Mit diesem Prinzip kann eine komplette Modbus-Tabelle definiert werden, die aus mehreren Registerblöcken besteht, die mit verschiedenen Modbus-Funktionscodes gelesen oder geschrieben werden müssen. Weitere Informationen finden Sie in den bestehenden Implementierungsklassen innerhalb des Quellcodes der Modbus Bridge.

source: Finally it is always a good idea to define a *debugLog()* method. This method is called in each cycle by the *Controller.Debug.Log* and very helpful for continuous debugging.
de: Schließlich ist es immer eine gute Idee, eine * debugLog-Log-Log-Methode () * zu definieren. Diese Methode wird in jedem Zyklus von der * Controller.Debug.Log * genannt und sehr hilfreich für ein kontinuierliches Debugging.

source: Start the device simulator
de: Starten Sie den Gerätesimulator

source: To start the device simulator, open the btn:[io.openems.edge.bridge.modbus] project and navigate to the btn:[test] -> btn:[io.openems.edge.brige.modbus] folder. There you find the btn:[ModbusSlaveSimulator.java] file. Right-click that file and select btn:[Run As] -> btn:[Java Application].
de: Um den Gerätesimulator zu starten, öffnen Sie das btn: [io.openems.edge.bridge.modbus]-Projekt und navigieren Sie zum Ordner btn: [test]-> btn: [io.openems.edge.brige.modbus]. Dort finden Sie die btn: [ModbusSlaveSimulator.java] Datei. Klicken Sie mit der rechten Maustaste auf die Datei und wählen Sie btn: [Run As] > btn: [Java Application].

source: This _ModbusSlaveSimulator_ runs a small Modbus-TCP _Slave_-Server, that provides some constant values:
de: Dieser _ ModbusSlaveSimulator _ betreibt einen kleinen Modbus-TCP _ Slave _-Server, der einige konstante Werte liefert:

source: |=== |Address |Constant value |1000 |500 |1001 |100 |2000 |123 |===
de: |=== | Adresse | Konstanter Wert 1000 | 500 | 1001 | 100 | 2000 | 123 |===

source: In the end of this guide, you will see a production of '500 W' - where '500' comes from register address 1000.
de: Am Ende dieses Leitfadens sehen Sie eine Produktion von ' 500 W '-wobei ' 500 ' von der Registeradresse 1000 stammt.

source: Enable the Component
de: Die Komponente aktivieren

source: To enable the Component for running, open the btn:[io.openems.edge.application] project and open the btn:[EdgeApp.bndrun] file. Change to the btn:[Source] view and create two new lines to declare the new Component.
de: Um die Komponente für das Laufen zu aktivieren, öffnen Sie das btn: [io.openems.edge.application]-Projekt und öffnen Sie die btn: [EdgeApp.bndrun]-Datei. Ändern Sie die btn: [Quelle]-Ansicht und erstellen Sie zwei neue Zeilen, um die neue Komponente zu deklarieren.

source: First: somewhere below *-runrequires: \* add `osgi.identity;filter:='(osgi.identity=io.openems.edge.meter.simulated)',\`
de: Erstens: Irgendwo unter *-runrequires: \ * add ' osgi.identity; filter: = ' (osgi.identity = io.openems.edge.meter.simulated) ', \ '

source: Second: somewhere below *-runbundles: \* add `io.openems.edge.meter.simulated;version=snapshot,\`
de: Zweitens: Irgendwo unter *-runbundles: \ * Add ' io.openems.edge.meter.simulated; version = Snapshot, \ '

source: You may have found, that the entries are sorted alphabetically.
de: Sie haben vielleicht festgestellt, dass die Einträge alphabetisch sortiert sind.

source: Run the implementation
de: Umsetzung laufen

source: Switch back to btn:[Run] view and press btn:[Run OSGi] to run OpenEMS Edge.
de: Wechseln Sie zurück zu btn: [Run]-Ansicht und drücken Sie ttn: [Run OSGi], um OpenEMS Edge laufen zu lassen.

source: From then you can configure your component as shown in xref:gettingstarted.adoc[Getting Started] guide. Add the following configurations inside Apache Felix Web Console:
de: Ab diesem Zeitpunkt können Sie Ihre Komponente so konfigurieren, wie sie in xref: gettingstarted.adoc [Getting Started]-Leitfaden gezeigt wird. Fügen Sie die folgenden Konfigurationen in der Apache Felix Web Console hinzu:

source: Enabled: `checked`
de: Aktiviert: "geprüft"

source: Scheduler All Alphabetically
de: Geedulter alles Alphabetisch

source: Cycle time: `1000`
de: Taktzeit: 1000

source: Bridge Modbus/TCP
de: Brücke Modbus/TCP

source: IP-Address: `localhost`
de: IP-Adresse: ' localhost '

source: Meter Simulated
de: Meter simuliert

source: Meter-Type: `PRODUCTION`
de: Metertyp: ' PRODUCTION '

source: In the Eclipse IDE console log you should see an output like this:
de: Im Eclipse IDE-Konsolenprotokoll sollten Sie eine Ausgabe wie diese sehen:

source: It shows a Production of `500 W` which is what is provided by the simulated meter device. Congrats!
de: Es zeigt eine Produktion von ' 500 W ', die durch das simulierte Zählergerät zur Verfügung gestellt wird. Congrats!

source: Physical hardware is abstracted in OpenEMS Edge using _Natures_. A Nature defines a set of characteristics and attributes which need to be provided by each OpenEMS component that implements it. These characteristics are defined by Channels. For example an implementation of an `Ess` (Energy Storage System), needs to provide an `Soc`-Channel (State of charge of the battery).
de: Physikalische Hardware wird in OpenEMS Edge mit _ Natures _ abstrahiert. Eine Natur definiert eine Reihe von Eigenschaften und Attributen, die von jeder OpenEMS-Komponente, die sie implementiert, bereitgestellt werden müssen. Diese Eigenschaften werden durch Kanäle definiert. Zum Beispiel muss die Einführung eines "Ess" (Energy Storage System) einen ' Soc '-Kanal (Ladezustand der Batterie) bereitstellen.

source: Technically Natures are implemented as OSGi API Bundles.
de: Technisch werden Natures als OSGi API Bundles implementiert.

source: A battery that is connected to a battery inverter.
de: Eine Batterie, die an einen Batteriewechselrichter angeschlossen ist.

source: A Controller; see the Controller chapter for details.
de: Ein Controller; Weitere Informationen finden Sie im Controller-Kapitel.

source: ESS (Energy Storage System)
de: Offenes Energiemanagementsystem

source: An Energy Storage System is an integrated system with battery and battery inverter.
de: Ein Energiespeicher-System ist ein integriertes System mit Batterie-und Batteriewechselrichter.

source: A generic Energy Storage System
de: Offenes Energiemanagementsystem

source: A symmetric Energy Storage System in readonly-mode.
de: Ein symmetrisches Energiespeicher-System im Lesemodus.

source: A symmetric, controllable Energy Storage System.
de: Ein symmetrisches, kontrollierbares Energiespeicher-System.

source: A solar charger that is connected to DC side of an energy storage system.
de: Ein Solarladegerät, das an die Gleichstromseite eines Energiespeichers angeschlossen ist.

source: A charging station for electric vehicles like e-cars and e-buses.
de: Eine Ladestation für Elektrofahrzeuge wie E-Autos und E-Busse.

source: One or more digital outputs or relays.
de: Ein oder mehrere digitale Ausgänge oder Relais.

source: A generic electric power meter.
de: Ein generischer Stromzähler.

source: A power meter for symmetric metering.
de: Ein Strommesser für symmetrische Dosierung.

source: A power meter for asymmetric metering.
de: Ein Machtmesser für asymmetrische Dosierung.

source: A Scheduler; see the Scheduler chapter for details.
de: Ein Scheduler; Details dazu finden Sie im Scheduler Kapitel.

source: A provider for time-series data, like historic recordings of Channels.
de: Ein Anbieter für Zeitreihendaten, wie historische Aufnahmen von Channels.

source: A OpenEMS Edge Scheduler plans the execution of Controllers. It defines...
de: Ein OpenEMS Edge Scheduler plant die Ausführung von Controllern. Sie definiert ...

source: which Controllers are executed
de: Welche Controller ausgeführt werden

source: in which priority the Controllers are executed
de: In welcher Priorität die Kontrolleure ausgeführt werden

source: All-Alphabetically
de: Alles Alphabetisch-AltrAlphabetisch-Ales-Alphabetisch-

source: Takes an ordered list of Component IDs. All remaining Controllers are afterwards ordered alphabetically by their ID.
de: Nimmt eine geordnete Liste der Bauteile auf. Alle verbliebenen Controller werden anschließend alphabetisch nach ihrer ID geordnet.

source: Fixed Order
de: Feste Bestellung

source: Takes a list of Component IDs and returns the Controllers statically sorted by this order.
de: Nimmt eine Liste von Komponentenausweisen auf und gibt die Controller statisch sortiert nach dieser Reihenfolge zurück.

source: OpenEMS
de: OpenEMS IoT Stack

source: Getting Started
de: Erste Schritte

source: This quick 'Getting Started' should help you setup up a complete development environment. On finishing you will have a working instance of OpenEMS Edge, with simulated energy storage and photovoltaic system, as well as an OpenEMS UI for monitoring the simulator inside your web browser.
de: Diese schnellen 'Ersten Schritte' sollten Ihnen helfen, eine komplette Entwicklungsumgebung einzurichten. Nach der Fertigstellung haben Sie eine funktionierende Instanz von OpenEMS Edge, mit simuliertem Stromspeichersystem und Photovoltaikanlage, sowie eine OpenEMS UI zur Überwachung des Simulators in Ihrem Webbrowser.

source: Download the source code
de: Den Quellcode herunterladen

source: Download any https://git-scm.com[git client icon:external-link[]] and install it. Our recommendation is https://www.sourcetreeapp.com/[Sourcetree by Atlassian icon:external-link[]]
de: Laden Sie alle https:/git-scm.com [git-client icon:external-link[]] herunter und installieren Sie es. Unsere Empfehlung lautet https://www.sourcetreeapp.com/[Sourcetree by Atlassian icon:external-link[]]

source: Clone the OpenEMS git repository
de: Klone das OpenEMS git-Repository

source: ... press btn:[File] -> btn:[Clone] ... enter the git repository path `https://github.com/OpenEMS/openems.git` ... select a target directory, for example `C:\Users\your.user\git\openems` ... open btn:[Advanced Settings] ... select the branch btn:[develop] ... and press btn:[Clone].
de: ... Drücken tn: [Datei]-> btn: [Clone] ... Geben Sie den git-Projektarchiv-Pfad `https://github.com/OpenEMS/openems.git` ein ... Wählen Sie ein Zielverzeichnis, zum Beispiel `C:\Users\your.user\git\` ... klicken Sie btn:[Advanced Settings] ... Wählen Sie den Zweig btn:[develop] ... Und drücken btn:[Clone].

source: Cloning the git repository using Sourcetree
de: Das git-Repository mit Sourcetree klonen

source: Alternatively: with the git command line utility
de: Alternativ: Mit dem git-Befehlszeilenprogramm

source: ... open a console ... change to the target directory ... execute `git clone https://github.com/OpenEMS/openems.git --branch develop`
de: ... Öffnen Sie eine Konsole ... Wechseln Sie in das Zielverzeichnis ... Ausführung `git clone https://github.com/OpenEMS/openems.git --branch develop`

source: Git is downloading the complete source code for you.
de: Git lädt den kompletten Quellcode für Sie herunter.

source: Setup Eclipse IDE for OpenEMS Edge and Backend
de: Setup Eclipse IDE für OpenEMS Edge und Backend

source: Prepare Eclipse IDE
de: Eclipse IDE vorbereiten

source: Download http://www.oracle.com/technetwork/java/javase/downloads/jdk8-downloads-2133151.html[Java SE Development Kit 8 icon:external-link[]] and install it
de: Download http://www.oracle.com/technetwork/java/javase/downloads/jdk8-downloads-2133151.html[Java SE Development Kit 8 icon:external-link[]] und Installation

source: Download https://www.eclipse.org[Eclipse for Java icon:external-link[]], install and start it
de: Download https://www.eclipse.org [Eclipse for Java icon:external-link[]], installieren und starten

source: On first start you will get asked to create a workspace. Select a directory - for example `C:\Users\your.user\git\openems-workspace` - and press btn:[Lauch]. _The directory needs to be different from your source code directory selected above._
de: Beim ersten Start werden Sie gebeten, einen Arbeitsraum zu schaffen. Wählen Sie ein Verzeichnis-zum Beispiel ' C:\Users\your.user\git\openems-Workspace '-und drücken Sie btn: [Lauch]. _ Das Verzeichnis muss sich von Ihrem oben ausgewählten Quellcode-Verzeichnis unterscheiden. _

source: Creating a workspace in Eclipse IDE
de: Schaffung eines Arbeitsraumes in Eclipse IDE

source: Install http://bndtools.org[BndTools icon:external-link[]] in Eclipse:
de: Installieren Sie http:/bndtools.org[BndTools icon:external-link[]] in Eclipse:

source: Menu: btn:[Help] → btn:[Eclipse Marketplace...] → btn:[Find:] → enter btn:[Bndtools] → press btn:[Install]
de: Menü: btn: [Help] → btn: [Eclipse Marketplace ...] → btn: [Find:] → enter btn: [bndtools] → press btn: [Install]

source: Import OpenEMS component projects (OSGi bundles):
de: Import von OpenEMS-Komponentenprojekten (OSGi Bundles):

source: Menu: btn:[File] → btn:[Import...] → btn:[Bndtools] → btn:[Existing Bnd Workspace] → Root directory: btn:[Browse...] → select the directory with the source code - for example `C:\Users\your.user\git\openems` → btn:[OK] → btn:[Finish] → "Switch to Bndtools perspective?" btn:[yes]
de: Menü: Btn: [File] → btn: [Import ...] → btn: [Bndtools] → btn: [Bestehendes Bnd Workspace] → Root-Verzeichnis: Btn: [Browse ...] → wählen Sie das Verzeichnis mit dem Quellcode-zum Beispiel ' C:\User\your.user\git\openems ' → btn: [OK] → btn: [Finish] → "Switch to Bndtools Perspektive? "Btn: [Ja]

source: Eclipse should have successfully built OpenEMS Edge and Backend, showing no entry in Problems.
de: Eclipse sollte OpenEMS Edge und Backend erfolgreich gebaut haben, was keinen Eintrag in Probleme zeigt.
